Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x24a4 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><c>: Abbrev Number: 40 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0xcf5a0): GNU C11 11.3.1 20220712 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0xc7781): ../Core/Src/main.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x4f6c5): C:/Users/G/CODE/FLOOR-HEATING-IO-MODULE/MODBUS/Modbus_Proj/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0x0
    <22>   DW_AT_stmt_list   : 0x0
    <26>   DW_AT_macros      : 0x0
 <1><2a>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <2b>   DW_AT_encoding    : 5	(signed)
    <2c>   DW_AT_byte_size   : 1
    <2d>   DW_AT_type        : <0x1e9>
    <31>   DW_AT_decl_file   : 5
    <32>   DW_AT_decl_line   : 68
    <33>   DW_AT_decl_column : 1
    <34>   DW_AT_sibling     : <0x1e9>
 <2><38>: Abbrev Number: 7 (DW_TAG_enumerator)
    <39>   DW_AT_name        : (indirect string, offset: 0xc68c7): NonMaskableInt_IRQn
    <3d>   DW_AT_const_value : -14
 <2><3e>: Abbrev Number: 7 (DW_TAG_enumerator)

    <1ec>   DW_AT_name        : (indirect string, offset: 0x70a16): signed char
 <1><1f0>: Abbrev Number: 4 (DW_TAG_typedef)
    <1f1>   DW_AT_name        : (indirect string, offset: 0xc3cb1): IRQn_Type
    <1f5>   DW_AT_decl_file   : 5
    <1f6>   DW_AT_decl_line   : 147
    <1f7>   DW_AT_decl_column : 3
    <1f8>   DW_AT_type        : <0x2a>
 <1><1fc>: Abbrev Number: 4 (DW_TAG_typedef)
    <1fd>   DW_AT_name        : (indirect string, offset: 0xb9f69): __int8_t
    <201>   DW_AT_decl_file   : 6
    <202>   DW_AT_decl_line   : 41
    <203>   DW_AT_decl_column : 23
    <204>   DW_AT_type        : <0x1e9>
 <1><208>: Abbrev Number: 4 (DW_TAG_typedef)
    <209>   DW_AT_name        : (indirect string, offset: 0x41227): __uint8_t
    <20d>   DW_AT_decl_file   : 6
    <20e>   DW_AT_decl_line   : 43
    <20f>   DW_AT_decl_column : 24
    <210>   DW_AT_type        : <0x214>
 <1><214>: Abbrev Number: 16 (DW_TAG_base_type)
    <215>   DW_AT_byte_size   : 1
    <216>   DW_AT_encoding    : 8	(unsigned char)
    <217>   DW_AT_name        : (indirect string, offset: 0xd8472): unsigned char
 <1><21b>: Abbrev Number: 16 (DW_TAG_base_type)
    <21c>   DW_AT_byte_size   : 2
    <21d>   DW_AT_encoding    : 5	(signed)
    <21e>   DW_AT_name        : (indirect string, offset: 0xcb245): short int
 <1><222>: Abbrev Number: 4 (DW_TAG_typedef)
    <223>   DW_AT_name        : (indirect string, offset: 0x5bcf3): __uint16_t
    <227>   DW_AT_decl_file   : 6
    <228>   DW_AT_decl_line   : 57
    <229>   DW_AT_decl_column : 25
    <22a>   DW_AT_type        : <0x22e>
 <1><22e>: Abbrev Number: 16 (DW_TAG_base_type)
    <22f>   DW_AT_byte_size   : 2
    <230>   DW_AT_encoding    : 7	(unsigned)
    <231>   DW_AT_name        : (indirect string, offset: 0xd6b6f): short unsigned int
 <1><235>: Abbrev Number: 16 (DW_TAG_base_type)
    <236>   DW_AT_byte_size   : 4
    <237>   DW_AT_encoding    : 5	(signed)
    <238>   DW_AT_name        : (indirect string, offset: 0x12827): long int
 <1><23c>: Abbrev Number: 4 (DW_TAG_typedef)
    <23d>   DW_AT_name        : (indirect string, offset: 0x8e8f0): __uint32_t
    <241>   DW_AT_decl_file   : 6
    <242>   DW_AT_decl_line   : 79
    <243>   DW_AT_decl_column : 25
    <244>   DW_AT_type        : <0x248>
 <1><248>: Abbrev Number: 16 (DW_TAG_base_type)
    <249>   DW_AT_byte_size   : 4
    <24a>   DW_AT_encoding    : 7	(unsigned)
    <24b>   DW_AT_name        : (indirect string, offset: 0x3518b): long unsigned int
 <1><24f>: Abbrev Number: 16 (DW_TAG_base_type)
    <250>   DW_AT_byte_size   : 8
    <251>   DW_AT_encoding    : 5	(signed)
    <252>   DW_AT_name        : (indirect string, offset: 0x665f9): long long int
 <1><256>: Abbrev Number: 16 (DW_TAG_base_type)
    <257>   DW_AT_byte_size   : 8
    <258>   DW_AT_encoding    : 7	(unsigned)
    <259>   DW_AT_name        : (indirect string, offset: 0x2e826): long long unsigned int
 <1><25d>: Abbrev Number: 41 (DW_TAG_base_type)
    <25e>   DW_AT_byte_size   : 4
    <25f>   DW_AT_encoding    : 5	(signed)
    <260>   DW_AT_name        : int
 <1><264>: Abbrev Number: 16 (DW_TAG_base_type)
    <265>   DW_AT_byte_size   : 4
    <266>   DW_AT_encoding    : 7	(unsigned)
    <267>   DW_AT_name        : (indirect string, offset: 0x11e8b): unsigned int
 <1><26b>: Abbrev Number: 4 (DW_TAG_typedef)
    <26c>   DW_AT_name        : (indirect string, offset: 0xb9f6b): int8_t
    <270>   DW_AT_decl_file   : 7
    <271>   DW_AT_decl_line   : 20
    <272>   DW_AT_decl_column : 18
    <273>   DW_AT_type        : <0x1fc>
 <1><277>: Abbrev Number: 4 (DW_TAG_typedef)
    <278>   DW_AT_name        : (indirect string, offset: 0x41229): uint8_t
    <27c>   DW_AT_decl_file   : 7
    <27d>   DW_AT_decl_line   : 24
    <27e>   DW_AT_decl_column : 19
    <27f>   DW_AT_type        : <0x208>
 <1><283>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <284>   DW_AT_type        : <0x277>
 <1><288>: Abbrev Number: 27 (DW_TAG_const_type)
    <289>   DW_AT_type        : <0x277>
 <1><28d>: Abbrev Number: 4 (DW_TAG_typedef)
    <28e>   DW_AT_name        : (indirect string, offset: 0xa3635): uint16_t
    <292>   DW_AT_decl_file   : 7
    <293>   DW_AT_decl_line   : 36
    <294>   DW_AT_decl_column : 20
    <295>   DW_AT_type        : <0x222>
 <1><299>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <29a>   DW_AT_type        : <0x28d>
 <1><29e>: Abbrev Number: 4 (DW_TAG_typedef)
    <29f>   DW_AT_name        : (indirect string, offset: 0xbcb82): uint32_t
    <2a3>   DW_AT_decl_file   : 7
    <2a4>   DW_AT_decl_line   : 48
    <2a5>   DW_AT_decl_column : 20
    <2a6>   DW_AT_type        : <0x23c>
 <1><2aa>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <2ab>   DW_AT_type        : <0x29e>
 <1><2af>: Abbrev Number: 13 (DW_TAG_array_type)
    <2b0>   DW_AT_type        : <0x29e>
    <2b4>   DW_AT_sibling     : <0x2bf>
 <2><2b8>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <2b9>   DW_AT_type        : <0x264>
    <2bd>   DW_AT_upper_bound : 14
 <2><2be>: Abbrev Number: 0
 <1><2bf>: Abbrev Number: 13 (DW_TAG_array_type)
    <2c0>   DW_AT_type        : <0x29e>
    <2c4>   DW_AT_sibling     : <0x2cf>
 <2><2c8>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <2c9>   DW_AT_type        : <0x264>
    <2cd>   DW_AT_upper_bound : 7
 <2><2ce>: Abbrev Number: 0
 <1><2cf>: Abbrev Number: 13 (DW_TAG_array_type)
    <2d0>   DW_AT_type        : <0x29e>
    <2d4>   DW_AT_sibling     : <0x2df>
 <2><2d8>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <2d9>   DW_AT_type        : <0x264>
    <2dd>   DW_AT_upper_bound : 3
 <2><2de>: Abbrev Number: 0
 <1><2df>: Abbrev Number: 11 (DW_TAG_structure_type)
    <2e0>   DW_AT_byte_size   : 20
    <2e1>   DW_AT_decl_file   : 5
    <2e2>   DW_AT_decl_line   : 258
    <2e4>   DW_AT_decl_column : 9
    <2e4>   DW_AT_sibling     : <0x32f>
 <2><2e8>: Abbrev Number: 5 (DW_TAG_member)
    <2e9>   DW_AT_name        : CCR
    <2ed>   DW_AT_decl_file   : 5
    <2ee>   DW_AT_decl_line   : 260
    <2f0>   DW_AT_decl_column : 17
    <2f1>   DW_AT_type        : <0x2aa>
    <2f5>   DW_AT_data_member_location: 0
 <2><2f6>: Abbrev Number: 1 (DW_TAG_member)
    <2f7>   DW_AT_name        : (indirect string, offset: 0x9206b): CNDTR
    <2fb>   DW_AT_decl_file   : 5
    <2fc>   DW_AT_decl_line   : 261
    <2fe>   DW_AT_decl_column : 17
    <2ff>   DW_AT_type        : <0x2aa>
    <303>   DW_AT_data_member_location: 4
 <2><304>: Abbrev Number: 1 (DW_TAG_member)
    <305>   DW_AT_name        : (indirect string, offset: 0xd85f7): CPAR
    <309>   DW_AT_decl_file   : 5
    <30a>   DW_AT_decl_line   : 262
    <30c>   DW_AT_decl_column : 17
    <30d>   DW_AT_type        : <0x2aa>
    <311>   DW_AT_data_member_location: 8
 <2><312>: Abbrev Number: 1 (DW_TAG_member)
    <313>   DW_AT_name        : (indirect string, offset: 0x7c60e): CMAR
    <317>   DW_AT_decl_file   : 5
    <318>   DW_AT_decl_line   : 263
    <31a>   DW_AT_decl_column : 17
    <31b>   DW_AT_type        : <0x2aa>
    <31f>   DW_AT_data_member_location: 12
 <2><320>: Abbrev Number: 1 (DW_TAG_member)
    <321>   DW_AT_name        : (indirect string, offset: 0x87af7): RESERVED
    <325>   DW_AT_decl_file   : 5
    <326>   DW_AT_decl_line   : 264
    <328>   DW_AT_decl_column : 12
    <329>   DW_AT_type        : <0x29e>
    <32d>   DW_AT_data_member_location: 16
 <2><32e>: Abbrev Number: 0
 <1><32f>: Abbrev Number: 9 (DW_TAG_typedef)
    <330>   DW_AT_name        : (indirect string, offset: 0xb65ac): DMA_Channel_TypeDef
    <334>   DW_AT_decl_file   : 5
    <335>   DW_AT_decl_line   : 265
    <337>   DW_AT_decl_column : 3
    <337>   DW_AT_type        : <0x2df>
 <1><33b>: Abbrev Number: 11 (DW_TAG_structure_type)
    <33c>   DW_AT_byte_size   : 8
    <33d>   DW_AT_decl_file   : 5
    <33e>   DW_AT_decl_line   : 267
    <340>   DW_AT_decl_column : 9
    <340>   DW_AT_sibling     : <0x361>
 <2><344>: Abbrev Number: 5 (DW_TAG_member)
    <345>   DW_AT_name        : ISR
    <349>   DW_AT_decl_file   : 5
    <34a>   DW_AT_decl_line   : 269
    <34c>   DW_AT_decl_column : 17
    <34d>   DW_AT_type        : <0x2aa>
    <351>   DW_AT_data_member_location: 0
 <2><352>: Abbrev Number: 1 (DW_TAG_member)
    <353>   DW_AT_name        : (indirect string, offset: 0x5666d): IFCR
    <357>   DW_AT_decl_file   : 5
    <358>   DW_AT_decl_line   : 270
    <35a>   DW_AT_decl_column : 17
    <35b>   DW_AT_type        : <0x2aa>
    <35f>   DW_AT_data_member_location: 4
 <2><360>: Abbrev Number: 0
 <1><361>: Abbrev Number: 9 (DW_TAG_typedef)
    <362>   DW_AT_name        : (indirect string, offset: 0x51649): DMA_TypeDef
    <366>   DW_AT_decl_file   : 5
    <367>   DW_AT_decl_line   : 271
    <369>   DW_AT_decl_column : 3
    <369>   DW_AT_type        : <0x33b>
 <1><36d>: Abbrev Number: 11 (DW_TAG_structure_type)
    <36e>   DW_AT_byte_size   : 4
    <36f>   DW_AT_decl_file   : 5
    <370>   DW_AT_decl_line   : 276
    <372>   DW_AT_decl_column : 9
    <372>   DW_AT_sibling     : <0x385>
 <2><376>: Abbrev Number: 5 (DW_TAG_member)
    <377>   DW_AT_name        : CCR
    <37b>   DW_AT_decl_file   : 5
    <37c>   DW_AT_decl_line   : 278
    <37e>   DW_AT_decl_column : 19
    <37f>   DW_AT_type        : <0x2aa>
    <383>   DW_AT_data_member_location: 0
 <2><384>: Abbrev Number: 0
 <1><385>: Abbrev Number: 9 (DW_TAG_typedef)
    <386>   DW_AT_name        : (indirect string, offset: 0xa2567): DMAMUX_Channel_TypeDef
    <38a>   DW_AT_decl_file   : 5
    <38b>   DW_AT_decl_line   : 279
    <38d>   DW_AT_decl_column : 3
    <38d>   DW_AT_type        : <0x36d>
 <1><391>: Abbrev Number: 11 (DW_TAG_structure_type)
    <392>   DW_AT_byte_size   : 8
    <393>   DW_AT_decl_file   : 5
    <394>   DW_AT_decl_line   : 281
    <396>   DW_AT_decl_column : 9
    <396>   DW_AT_sibling     : <0x3b7>
 <2><39a>: Abbrev Number: 5 (DW_TAG_member)
    <39b>   DW_AT_name        : CSR
    <39f>   DW_AT_decl_file   : 5
    <3a0>   DW_AT_decl_line   : 283
    <3a2>   DW_AT_decl_column : 19
    <3a3>   DW_AT_type        : <0x2aa>
    <3a7>   DW_AT_data_member_location: 0
 <2><3a8>: Abbrev Number: 5 (DW_TAG_member)
    <3a9>   DW_AT_name        : CFR
    <3ad>   DW_AT_decl_file   : 5
    <3ae>   DW_AT_decl_line   : 284
    <3b0>   DW_AT_decl_column : 19
    <3b1>   DW_AT_type        : <0x2aa>
    <3b5>   DW_AT_data_member_location: 4
 <2><3b6>: Abbrev Number: 0
 <1><3b7>: Abbrev Number: 9 (DW_TAG_typedef)
    <3b8>   DW_AT_name        : (indirect string, offset: 0xd3a0d): DMAMUX_ChannelStatus_TypeDef
    <3bc>   DW_AT_decl_file   : 5
    <3bd>   DW_AT_decl_line   : 285
    <3bf>   DW_AT_decl_column : 3
    <3bf>   DW_AT_type        : <0x391>
 <1><3c3>: Abbrev Number: 11 (DW_TAG_structure_type)
    <3c4>   DW_AT_byte_size   : 4
    <3c5>   DW_AT_decl_file   : 5
    <3c6>   DW_AT_decl_line   : 287
    <3c8>   DW_AT_decl_column : 9
    <3c8>   DW_AT_sibling     : <0x3db>
 <2><3cc>: Abbrev Number: 1 (DW_TAG_member)
    <3cd>   DW_AT_name        : (indirect string, offset: 0x6e9b4): RGCR
    <3d1>   DW_AT_decl_file   : 5
    <3d2>   DW_AT_decl_line   : 289
    <3d4>   DW_AT_decl_column : 19
    <3d5>   DW_AT_type        : <0x2aa>
    <3d9>   DW_AT_data_member_location: 0
 <2><3da>: Abbrev Number: 0
 <1><3db>: Abbrev Number: 9 (DW_TAG_typedef)
    <3dc>   DW_AT_name        : (indirect string, offset: 0x848b6): DMAMUX_RequestGen_TypeDef
    <3e0>   DW_AT_decl_file   : 5
    <3e1>   DW_AT_decl_line   : 290
    <3e3>   DW_AT_decl_column : 3
    <3e3>   DW_AT_type        : <0x3c3>
 <1><3e7>: Abbrev Number: 11 (DW_TAG_structure_type)
    <3e8>   DW_AT_byte_size   : 8
    <3e9>   DW_AT_decl_file   : 5
    <3ea>   DW_AT_decl_line   : 292
    <3ec>   DW_AT_decl_column : 9
    <3ec>   DW_AT_sibling     : <0x40d>
 <2><3f0>: Abbrev Number: 1 (DW_TAG_member)
    <3f1>   DW_AT_name        : (indirect string, offset: 0x75edc): RGSR
    <3f5>   DW_AT_decl_file   : 5
    <3f6>   DW_AT_decl_line   : 294
    <3f8>   DW_AT_decl_column : 19
    <3f9>   DW_AT_type        : <0x2aa>
    <3fd>   DW_AT_data_member_location: 0
 <2><3fe>: Abbrev Number: 1 (DW_TAG_member)
    <3ff>   DW_AT_name        : (indirect string, offset: 0x223): RGCFR
    <403>   DW_AT_decl_file   : 5
    <404>   DW_AT_decl_line   : 295
    <406>   DW_AT_decl_column : 19
    <407>   DW_AT_type        : <0x2aa>
    <40b>   DW_AT_data_member_location: 4
 <2><40c>: Abbrev Number: 0
 <1><40d>: Abbrev Number: 9 (DW_TAG_typedef)
    <40e>   DW_AT_name        : (indirect string, offset: 0x2d235): DMAMUX_RequestGenStatus_TypeDef
    <412>   DW_AT_decl_file   : 5
    <413>   DW_AT_decl_line   : 296
    <415>   DW_AT_decl_column : 3
    <415>   DW_AT_type        : <0x3e7>
 <1><419>: Abbrev Number: 11 (DW_TAG_structure_type)
    <41a>   DW_AT_byte_size   : 44
    <41b>   DW_AT_decl_file   : 5
    <41c>   DW_AT_decl_line   : 331
    <41e>   DW_AT_decl_column : 9
    <41e>   DW_AT_sibling     : <0x4af>
 <2><422>: Abbrev Number: 1 (DW_TAG_member)
    <423>   DW_AT_name        : (indirect string, offset: 0x159c): MODER
    <427>   DW_AT_decl_file   : 5
    <428>   DW_AT_decl_line   : 333
    <42a>   DW_AT_decl_column : 17
    <42b>   DW_AT_type        : <0x2aa>
    <42f>   DW_AT_data_member_location: 0
 <2><430>: Abbrev Number: 1 (DW_TAG_member)
    <431>   DW_AT_name        : (indirect string, offset: 0xadc20): OTYPER
    <435>   DW_AT_decl_file   : 5
    <436>   DW_AT_decl_line   : 334
    <438>   DW_AT_decl_column : 17
    <439>   DW_AT_type        : <0x2aa>
    <43d>   DW_AT_data_member_location: 4
 <2><43e>: Abbrev Number: 1 (DW_TAG_member)
    <43f>   DW_AT_name        : (indirect string, offset: 0xc30fa): OSPEEDR
    <443>   DW_AT_decl_file   : 5
    <444>   DW_AT_decl_line   : 335
    <446>   DW_AT_decl_column : 17
    <447>   DW_AT_type        : <0x2aa>
    <44b>   DW_AT_data_member_location: 8
 <2><44c>: Abbrev Number: 1 (DW_TAG_member)
    <44d>   DW_AT_name        : (indirect string, offset: 0xa00d7): PUPDR
    <451>   DW_AT_decl_file   : 5
    <452>   DW_AT_decl_line   : 336
    <454>   DW_AT_decl_column : 17
    <455>   DW_AT_type        : <0x2aa>
    <459>   DW_AT_data_member_location: 12
 <2><45a>: Abbrev Number: 5 (DW_TAG_member)
    <45b>   DW_AT_name        : IDR
    <45f>   DW_AT_decl_file   : 5
    <460>   DW_AT_decl_line   : 337
    <462>   DW_AT_decl_column : 17
    <463>   DW_AT_type        : <0x2aa>
    <467>   DW_AT_data_member_location: 16
 <2><468>: Abbrev Number: 5 (DW_TAG_member)
    <469>   DW_AT_name        : ODR
    <46d>   DW_AT_decl_file   : 5
    <46e>   DW_AT_decl_line   : 338
    <470>   DW_AT_decl_column : 17
    <471>   DW_AT_type        : <0x2aa>
    <475>   DW_AT_data_member_location: 20
 <2><476>: Abbrev Number: 1 (DW_TAG_member)
    <477>   DW_AT_name        : (indirect string, offset: 0x60758): BSRR
    <47b>   DW_AT_decl_file   : 5
    <47c>   DW_AT_decl_line   : 339
    <47e>   DW_AT_decl_column : 17
    <47f>   DW_AT_type        : <0x2aa>
    <483>   DW_AT_data_member_location: 24
 <2><484>: Abbrev Number: 1 (DW_TAG_member)
    <485>   DW_AT_name        : (indirect string, offset: 0x9d6dc): LCKR
    <489>   DW_AT_decl_file   : 5
    <48a>   DW_AT_decl_line   : 340
    <48c>   DW_AT_decl_column : 17
    <48d>   DW_AT_type        : <0x2aa>
    <491>   DW_AT_data_member_location: 28
 <2><492>: Abbrev Number: 5 (DW_TAG_member)
    <493>   DW_AT_name        : AFR
    <497>   DW_AT_decl_file   : 5
    <498>   DW_AT_decl_line   : 341
    <49a>   DW_AT_decl_column : 17
    <49b>   DW_AT_type        : <0x4bf>
    <49f>   DW_AT_data_member_location: 32
 <2><4a0>: Abbrev Number: 5 (DW_TAG_member)
    <4a1>   DW_AT_name        : BRR
    <4a5>   DW_AT_decl_file   : 5
    <4a6>   DW_AT_decl_line   : 342
    <4a8>   DW_AT_decl_column : 17
    <4a9>   DW_AT_type        : <0x2aa>
    <4ad>   DW_AT_data_member_location: 40
 <2><4ae>: Abbrev Number: 0
 <1><4af>: Abbrev Number: 13 (DW_TAG_array_type)
    <4b0>   DW_AT_type        : <0x2aa>
    <4b4>   DW_AT_sibling     : <0x4bf>
 <2><4b8>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <4b9>   DW_AT_type        : <0x264>
    <4bd>   DW_AT_upper_bound : 1
 <2><4be>: Abbrev Number: 0
 <1><4bf>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <4c0>   DW_AT_type        : <0x4af>
 <1><4c4>: Abbrev Number: 9 (DW_TAG_typedef)
    <4c5>   DW_AT_name        : (indirect string, offset: 0xd96b6): GPIO_TypeDef
    <4c9>   DW_AT_decl_file   : 5
    <4ca>   DW_AT_decl_line   : 343
    <4cc>   DW_AT_decl_column : 3
    <4cc>   DW_AT_type        : <0x419>
 <1><4d0>: Abbrev Number: 11 (DW_TAG_structure_type)
    <4d1>   DW_AT_byte_size   : 140
    <4d2>   DW_AT_decl_file   : 5
    <4d3>   DW_AT_decl_line   : 394
    <4d5>   DW_AT_decl_column : 9
    <4d5>   DW_AT_sibling     : <0x638>
 <2><4d9>: Abbrev Number: 5 (DW_TAG_member)
    <4da>   DW_AT_name        : CR1
    <4de>   DW_AT_decl_file   : 5
    <4df>   DW_AT_decl_line   : 396
    <4e1>   DW_AT_decl_column : 17
    <4e2>   DW_AT_type        : <0x2aa>
    <4e6>   DW_AT_data_member_location: 0
 <2><4e7>: Abbrev Number: 5 (DW_TAG_member)
    <4e8>   DW_AT_name        : CR2
    <4ec>   DW_AT_decl_file   : 5
    <4ed>   DW_AT_decl_line   : 397
    <4ef>   DW_AT_decl_column : 17
    <4f0>   DW_AT_type        : <0x2aa>
    <4f4>   DW_AT_data_member_location: 4
 <2><4f5>: Abbrev Number: 5 (DW_TAG_member)
    <4f6>   DW_AT_name        : CR3
    <4fa>   DW_AT_decl_file   : 5
    <4fb>   DW_AT_decl_line   : 398
    <4fd>   DW_AT_decl_column : 17
    <4fe>   DW_AT_type        : <0x2aa>
    <502>   DW_AT_data_member_location: 8
 <2><503>: Abbrev Number: 5 (DW_TAG_member)
    <504>   DW_AT_name        : CR4
    <508>   DW_AT_decl_file   : 5
    <509>   DW_AT_decl_line   : 399
    <50b>   DW_AT_decl_column : 17
    <50c>   DW_AT_type        : <0x2aa>
    <510>   DW_AT_data_member_location: 12
 <2><511>: Abbrev Number: 5 (DW_TAG_member)
    <512>   DW_AT_name        : SR1
    <516>   DW_AT_decl_file   : 5
    <517>   DW_AT_decl_line   : 400
    <519>   DW_AT_decl_column : 17
    <51a>   DW_AT_type        : <0x2aa>
    <51e>   DW_AT_data_member_location: 16
 <2><51f>: Abbrev Number: 5 (DW_TAG_member)
    <520>   DW_AT_name        : SR2
    <524>   DW_AT_decl_file   : 5
    <525>   DW_AT_decl_line   : 401
    <527>   DW_AT_decl_column : 17
    <528>   DW_AT_type        : <0x2aa>
    <52c>   DW_AT_data_member_location: 20
 <2><52d>: Abbrev Number: 5 (DW_TAG_member)
    <52e>   DW_AT_name        : SCR
    <532>   DW_AT_decl_file   : 5
    <533>   DW_AT_decl_line   : 402
    <535>   DW_AT_decl_column : 17
    <536>   DW_AT_type        : <0x2aa>
    <53a>   DW_AT_data_member_location: 24
 <2><53b>: Abbrev Number: 5 (DW_TAG_member)
    <53c>   DW_AT_name        : CR5
    <540>   DW_AT_decl_file   : 5
    <541>   DW_AT_decl_line   : 403
    <543>   DW_AT_decl_column : 17
    <544>   DW_AT_type        : <0x2aa>
    <548>   DW_AT_data_member_location: 28
 <2><549>: Abbrev Number: 1 (DW_TAG_member)
    <54a>   DW_AT_name        : (indirect string, offset: 0xd7714): PUCRA
    <54e>   DW_AT_decl_file   : 5
    <54f>   DW_AT_decl_line   : 404
    <551>   DW_AT_decl_column : 17
    <552>   DW_AT_type        : <0x2aa>
    <556>   DW_AT_data_member_location: 32
 <2><557>: Abbrev Number: 1 (DW_TAG_member)
    <558>   DW_AT_name        : (indirect string, offset: 0xbb48f): PDCRA
    <55c>   DW_AT_decl_file   : 5
    <55d>   DW_AT_decl_line   : 405
    <55f>   DW_AT_decl_column : 17
    <560>   DW_AT_type        : <0x2aa>
    <564>   DW_AT_data_member_location: 36
 <2><565>: Abbrev Number: 1 (DW_TAG_member)
    <566>   DW_AT_name        : (indirect string, offset: 0x966cd): PUCRB
    <56a>   DW_AT_decl_file   : 5
    <56b>   DW_AT_decl_line   : 406
    <56d>   DW_AT_decl_column : 17
    <56e>   DW_AT_type        : <0x2aa>
    <572>   DW_AT_data_member_location: 40
 <2><573>: Abbrev Number: 1 (DW_TAG_member)
    <574>   DW_AT_name        : (indirect string, offset: 0xbb495): PDCRB
    <578>   DW_AT_decl_file   : 5
    <579>   DW_AT_decl_line   : 407
    <57b>   DW_AT_decl_column : 17
    <57c>   DW_AT_type        : <0x2aa>
    <580>   DW_AT_data_member_location: 44
 <2><581>: Abbrev Number: 1 (DW_TAG_member)
    <582>   DW_AT_name        : (indirect string, offset: 0xd7734): PUCRC
    <586>   DW_AT_decl_file   : 5
    <587>   DW_AT_decl_line   : 408
    <589>   DW_AT_decl_column : 17
    <58a>   DW_AT_type        : <0x2aa>
    <58e>   DW_AT_data_member_location: 48
 <2><58f>: Abbrev Number: 1 (DW_TAG_member)
    <590>   DW_AT_name        : (indirect string, offset: 0xbb49b): PDCRC
    <594>   DW_AT_decl_file   : 5
    <595>   DW_AT_decl_line   : 409
    <597>   DW_AT_decl_column : 17
    <598>   DW_AT_type        : <0x2aa>
    <59c>   DW_AT_data_member_location: 52
 <2><59d>: Abbrev Number: 1 (DW_TAG_member)
    <59e>   DW_AT_name        : (indirect string, offset: 0x966ef): PUCRD
    <5a2>   DW_AT_decl_file   : 5
    <5a3>   DW_AT_decl_line   : 410
    <5a5>   DW_AT_decl_column : 17
    <5a6>   DW_AT_type        : <0x2aa>
    <5aa>   DW_AT_data_member_location: 56
 <2><5ab>: Abbrev Number: 1 (DW_TAG_member)
    <5ac>   DW_AT_name        : (indirect string, offset: 0xbb4a1): PDCRD
    <5b0>   DW_AT_decl_file   : 5
    <5b1>   DW_AT_decl_line   : 411
    <5b3>   DW_AT_decl_column : 17
    <5b4>   DW_AT_type        : <0x2aa>
    <5b8>   DW_AT_data_member_location: 60
 <2><5b9>: Abbrev Number: 1 (DW_TAG_member)
    <5ba>   DW_AT_name        : (indirect string, offset: 0xd7764): PUCRE
    <5be>   DW_AT_decl_file   : 5
    <5bf>   DW_AT_decl_line   : 412
    <5c1>   DW_AT_decl_column : 17
    <5c2>   DW_AT_type        : <0x2aa>
    <5c6>   DW_AT_data_member_location: 64
 <2><5c7>: Abbrev Number: 1 (DW_TAG_member)
    <5c8>   DW_AT_name        : (indirect string, offset: 0xbb4a7): PDCRE
    <5cc>   DW_AT_decl_file   : 5
    <5cd>   DW_AT_decl_line   : 413
    <5cf>   DW_AT_decl_column : 17
    <5d0>   DW_AT_type        : <0x2aa>
    <5d4>   DW_AT_data_member_location: 68
 <2><5d5>: Abbrev Number: 1 (DW_TAG_member)
    <5d6>   DW_AT_name        : (indirect string, offset: 0xd2f9b): RESERVED0
    <5da>   DW_AT_decl_file   : 5
    <5db>   DW_AT_decl_line   : 414
    <5dd>   DW_AT_decl_column : 17
    <5de>   DW_AT_type        : <0x2cf>
    <5e2>   DW_AT_data_member_location: 72
 <2><5e3>: Abbrev Number: 1 (DW_TAG_member)
    <5e4>   DW_AT_name        : (indirect string, offset: 0xd778e): PUCRH
    <5e8>   DW_AT_decl_file   : 5
    <5e9>   DW_AT_decl_line   : 415
    <5eb>   DW_AT_decl_column : 17
    <5ec>   DW_AT_type        : <0x2aa>
    <5f0>   DW_AT_data_member_location: 88
 <2><5f1>: Abbrev Number: 1 (DW_TAG_member)
    <5f2>   DW_AT_name        : (indirect string, offset: 0xbb4ad): PDCRH
    <5f6>   DW_AT_decl_file   : 5
    <5f7>   DW_AT_decl_line   : 416
    <5f9>   DW_AT_decl_column : 17
    <5fa>   DW_AT_type        : <0x2aa>
    <5fe>   DW_AT_data_member_location: 92
 <2><5ff>: Abbrev Number: 1 (DW_TAG_member)
    <600>   DW_AT_name        : (indirect string, offset: 0xd2fa5): RESERVED1
    <604>   DW_AT_decl_file   : 5
    <605>   DW_AT_decl_line   : 417
    <607>   DW_AT_decl_column : 17
    <608>   DW_AT_type        : <0x2bf>
    <60c>   DW_AT_data_member_location: 96
 <2><60d>: Abbrev Number: 1 (DW_TAG_member)
    <60e>   DW_AT_name        : (indirect string, offset: 0x80ab1): C2CR1
    <612>   DW_AT_decl_file   : 5
    <613>   DW_AT_decl_line   : 418
    <615>   DW_AT_decl_column : 17
    <616>   DW_AT_type        : <0x2aa>
    <61a>   DW_AT_data_member_location: 128
 <2><61b>: Abbrev Number: 1 (DW_TAG_member)
    <61c>   DW_AT_name        : (indirect string, offset: 0x50227): C2CR3
    <620>   DW_AT_decl_file   : 5
    <621>   DW_AT_decl_line   : 419
    <623>   DW_AT_decl_column : 17
    <624>   DW_AT_type        : <0x2aa>
    <628>   DW_AT_data_member_location: 132
 <2><629>: Abbrev Number: 1 (DW_TAG_member)
    <62a>   DW_AT_name        : (indirect string, offset: 0x1febf): EXTSCR
    <62e>   DW_AT_decl_file   : 5
    <62f>   DW_AT_decl_line   : 420
    <631>   DW_AT_decl_column : 17
    <632>   DW_AT_type        : <0x2aa>
    <636>   DW_AT_data_member_location: 136
 <2><637>: Abbrev Number: 0
 <1><638>: Abbrev Number: 9 (DW_TAG_typedef)
    <639>   DW_AT_name        : (indirect string, offset: 0xa214f): PWR_TypeDef
    <63d>   DW_AT_decl_file   : 5
    <63e>   DW_AT_decl_line   : 421
    <640>   DW_AT_decl_column : 3
    <640>   DW_AT_type        : <0x4d0>
 <1><644>: Abbrev Number: 42 (DW_TAG_structure_type)
    <645>   DW_AT_byte_size   : 392
    <647>   DW_AT_decl_file   : 5
    <648>   DW_AT_decl_line   : 446
    <64a>   DW_AT_decl_column : 9
    <64b>   DW_AT_sibling     : <0x977>
 <2><64f>: Abbrev Number: 5 (DW_TAG_member)
    <650>   DW_AT_name        : CR
    <653>   DW_AT_decl_file   : 5
    <654>   DW_AT_decl_line   : 448
    <656>   DW_AT_decl_column : 17
    <657>   DW_AT_type        : <0x2aa>
    <65b>   DW_AT_data_member_location: 0
 <2><65c>: Abbrev Number: 1 (DW_TAG_member)
    <65d>   DW_AT_name        : (indirect string, offset: 0x8bf07): ICSCR
    <661>   DW_AT_decl_file   : 5
    <662>   DW_AT_decl_line   : 449
    <664>   DW_AT_decl_column : 17
    <665>   DW_AT_type        : <0x2aa>
    <669>   DW_AT_data_member_location: 4
 <2><66a>: Abbrev Number: 1 (DW_TAG_member)
    <66b>   DW_AT_name        : (indirect string, offset: 0x49763): CFGR
    <66f>   DW_AT_decl_file   : 5
    <670>   DW_AT_decl_line   : 450
    <672>   DW_AT_decl_column : 17
    <673>   DW_AT_type        : <0x2aa>
    <677>   DW_AT_data_member_location: 8
 <2><678>: Abbrev Number: 1 (DW_TAG_member)
    <679>   DW_AT_name        : (indirect string, offset: 0x9d4d7): PLLCFGR
    <67d>   DW_AT_decl_file   : 5
    <67e>   DW_AT_decl_line   : 451
    <680>   DW_AT_decl_column : 17
    <681>   DW_AT_type        : <0x2aa>
    <685>   DW_AT_data_member_location: 12
 <2><686>: Abbrev Number: 1 (DW_TAG_member)
    <687>   DW_AT_name        : (indirect string, offset: 0x4975c): PLLSAI1CFGR
    <68b>   DW_AT_decl_file   : 5
    <68c>   DW_AT_decl_line   : 452
    <68e>   DW_AT_decl_column : 17
    <68f>   DW_AT_type        : <0x2aa>
    <693>   DW_AT_data_member_location: 16
 <2><694>: Abbrev Number: 1 (DW_TAG_member)
    <695>   DW_AT_name        : (indirect string, offset: 0xd2f9b): RESERVED0
    <699>   DW_AT_decl_file   : 5
    <69a>   DW_AT_decl_line   : 453
    <69c>   DW_AT_decl_column : 17
    <69d>   DW_AT_type        : <0x29e>
    <6a1>   DW_AT_data_member_location: 20
 <2><6a2>: Abbrev Number: 1 (DW_TAG_member)
    <6a3>   DW_AT_name        : (indirect string, offset: 0x1838): CIER
    <6a7>   DW_AT_decl_file   : 5
    <6a8>   DW_AT_decl_line   : 454
    <6aa>   DW_AT_decl_column : 17
    <6ab>   DW_AT_type        : <0x2aa>
    <6af>   DW_AT_data_member_location: 24
 <2><6b0>: Abbrev Number: 1 (DW_TAG_member)
    <6b1>   DW_AT_name        : (indirect string, offset: 0x3096): CIFR
    <6b5>   DW_AT_decl_file   : 5
    <6b6>   DW_AT_decl_line   : 455
    <6b8>   DW_AT_decl_column : 17
    <6b9>   DW_AT_type        : <0x2aa>
    <6bd>   DW_AT_data_member_location: 28
 <2><6be>: Abbrev Number: 1 (DW_TAG_member)
    <6bf>   DW_AT_name        : (indirect string, offset: 0x1b33): CICR
    <6c3>   DW_AT_decl_file   : 5
    <6c4>   DW_AT_decl_line   : 456
    <6c6>   DW_AT_decl_column : 17
    <6c7>   DW_AT_type        : <0x2aa>
    <6cb>   DW_AT_data_member_location: 32
 <2><6cc>: Abbrev Number: 1 (DW_TAG_member)
    <6cd>   DW_AT_name        : (indirect string, offset: 0xb968): SMPSCR
    <6d1>   DW_AT_decl_file   : 5
    <6d2>   DW_AT_decl_line   : 457
    <6d4>   DW_AT_decl_column : 17
    <6d5>   DW_AT_type        : <0x2aa>
    <6d9>   DW_AT_data_member_location: 36
 <2><6da>: Abbrev Number: 1 (DW_TAG_member)
    <6db>   DW_AT_name        : (indirect string, offset: 0xb2c74): AHB1RSTR
    <6df>   DW_AT_decl_file   : 5
    <6e0>   DW_AT_decl_line   : 458
    <6e2>   DW_AT_decl_column : 17
    <6e3>   DW_AT_type        : <0x2aa>
    <6e7>   DW_AT_data_member_location: 40
 <2><6e8>: Abbrev Number: 1 (DW_TAG_member)
    <6e9>   DW_AT_name        : (indirect string, offset: 0x199dc): AHB2RSTR
    <6ed>   DW_AT_decl_file   : 5
    <6ee>   DW_AT_decl_line   : 459
    <6f0>   DW_AT_decl_column : 17
    <6f1>   DW_AT_type        : <0x2aa>
    <6f5>   DW_AT_data_member_location: 44
 <2><6f6>: Abbrev Number: 1 (DW_TAG_member)
    <6f7>   DW_AT_name        : (indirect string, offset: 0x60ff5): AHB3RSTR
    <6fb>   DW_AT_decl_file   : 5
    <6fc>   DW_AT_decl_line   : 460
    <6fe>   DW_AT_decl_column : 17
    <6ff>   DW_AT_type        : <0x2aa>
    <703>   DW_AT_data_member_location: 48
 <2><704>: Abbrev Number: 1 (DW_TAG_member)
    <705>   DW_AT_name        : (indirect string, offset: 0xd2fa5): RESERVED1
    <709>   DW_AT_decl_file   : 5
    <70a>   DW_AT_decl_line   : 461
    <70c>   DW_AT_decl_column : 17
    <70d>   DW_AT_type        : <0x29e>
    <711>   DW_AT_data_member_location: 52
 <2><712>: Abbrev Number: 1 (DW_TAG_member)
    <713>   DW_AT_name        : (indirect string, offset: 0x2d678): APB1RSTR1
    <717>   DW_AT_decl_file   : 5
    <718>   DW_AT_decl_line   : 462
    <71a>   DW_AT_decl_column : 17
    <71b>   DW_AT_type        : <0x2aa>
    <71f>   DW_AT_data_member_location: 56
 <2><720>: Abbrev Number: 1 (DW_TAG_member)
    <721>   DW_AT_name        : (indirect string, offset: 0x2d682): APB1RSTR2
    <725>   DW_AT_decl_file   : 5
    <726>   DW_AT_decl_line   : 463
    <728>   DW_AT_decl_column : 17
    <729>   DW_AT_type        : <0x2aa>
    <72d>   DW_AT_data_member_location: 60
 <2><72e>: Abbrev Number: 1 (DW_TAG_member)
    <72f>   DW_AT_name        : (indirect string, offset: 0x60aa7): APB2RSTR
    <733>   DW_AT_decl_file   : 5
    <734>   DW_AT_decl_line   : 464
    <736>   DW_AT_decl_column : 17
    <737>   DW_AT_type        : <0x2aa>
    <73b>   DW_AT_data_member_location: 64
 <2><73c>: Abbrev Number: 1 (DW_TAG_member)
    <73d>   DW_AT_name        : (indirect string, offset: 0xa9aed): APB3RSTR
    <741>   DW_AT_decl_file   : 5
    <742>   DW_AT_decl_line   : 465
    <744>   DW_AT_decl_column : 17
    <745>   DW_AT_type        : <0x2aa>
    <749>   DW_AT_data_member_location: 68
 <2><74a>: Abbrev Number: 1 (DW_TAG_member)
    <74b>   DW_AT_name        : (indirect string, offset: 0xbc441): AHB1ENR
    <74f>   DW_AT_decl_file   : 5
    <750>   DW_AT_decl_line   : 466
    <752>   DW_AT_decl_column : 17
    <753>   DW_AT_type        : <0x2aa>
    <757>   DW_AT_data_member_location: 72
 <2><758>: Abbrev Number: 1 (DW_TAG_member)
    <759>   DW_AT_name        : (indirect string, offset: 0x9f4ab): AHB2ENR
    <75d>   DW_AT_decl_file   : 5
    <75e>   DW_AT_decl_line   : 467
    <760>   DW_AT_decl_column : 17
    <761>   DW_AT_type        : <0x2aa>
    <765>   DW_AT_data_member_location: 76
 <2><766>: Abbrev Number: 1 (DW_TAG_member)
    <767>   DW_AT_name        : (indirect string, offset: 0xc8cf5): AHB3ENR
    <76b>   DW_AT_decl_file   : 5
    <76c>   DW_AT_decl_line   : 468
    <76e>   DW_AT_decl_column : 17
    <76f>   DW_AT_type        : <0x2aa>
    <773>   DW_AT_data_member_location: 80
 <2><774>: Abbrev Number: 1 (DW_TAG_member)
    <775>   DW_AT_name        : (indirect string, offset: 0xd2faf): RESERVED2
    <779>   DW_AT_decl_file   : 5
    <77a>   DW_AT_decl_line   : 469
    <77c>   DW_AT_decl_column : 17
    <77d>   DW_AT_type        : <0x29e>
    <781>   DW_AT_data_member_location: 84
 <2><782>: Abbrev Number: 1 (DW_TAG_member)
    <783>   DW_AT_name        : (indirect string, offset: 0x31ec7): APB1ENR1
    <787>   DW_AT_decl_file   : 5
    <788>   DW_AT_decl_line   : 470
    <78a>   DW_AT_decl_column : 17
    <78b>   DW_AT_type        : <0x2aa>
    <78f>   DW_AT_data_member_location: 88
 <2><790>: Abbrev Number: 1 (DW_TAG_member)
    <791>   DW_AT_name        : (indirect string, offset: 0x31ed2): APB1ENR2
    <795>   DW_AT_decl_file   : 5
    <796>   DW_AT_decl_line   : 471
    <798>   DW_AT_decl_column : 17
    <799>   DW_AT_type        : <0x2aa>
    <79d>   DW_AT_data_member_location: 92
 <2><79e>: Abbrev Number: 1 (DW_TAG_member)
    <79f>   DW_AT_name        : (indirect string, offset: 0x3770b): APB2ENR
    <7a3>   DW_AT_decl_file   : 5
    <7a4>   DW_AT_decl_line   : 472
    <7a6>   DW_AT_decl_column : 17
    <7a7>   DW_AT_type        : <0x2aa>
    <7ab>   DW_AT_data_member_location: 96
 <2><7ac>: Abbrev Number: 1 (DW_TAG_member)
    <7ad>   DW_AT_name        : (indirect string, offset: 0x857ee): RESERVED3
    <7b1>   DW_AT_decl_file   : 5
    <7b2>   DW_AT_decl_line   : 473
    <7b4>   DW_AT_decl_column : 17
    <7b5>   DW_AT_type        : <0x29e>
    <7b9>   DW_AT_data_member_location: 100
 <2><7ba>: Abbrev Number: 1 (DW_TAG_member)
    <7bb>   DW_AT_name        : (indirect string, offset: 0x2c1f2): AHB1SMENR
    <7bf>   DW_AT_decl_file   : 5
    <7c0>   DW_AT_decl_line   : 474
    <7c2>   DW_AT_decl_column : 17
    <7c3>   DW_AT_type        : <0x2aa>
    <7c7>   DW_AT_data_member_location: 104
 <2><7c8>: Abbrev Number: 1 (DW_TAG_member)
    <7c9>   DW_AT_name        : (indirect string, offset: 0x91e6d): AHB2SMENR
    <7cd>   DW_AT_decl_file   : 5
    <7ce>   DW_AT_decl_line   : 475
    <7d0>   DW_AT_decl_column : 17
    <7d1>   DW_AT_type        : <0x2aa>
    <7d5>   DW_AT_data_member_location: 108
 <2><7d6>: Abbrev Number: 1 (DW_TAG_member)
    <7d7>   DW_AT_name        : (indirect string, offset: 0x1658a): AHB3SMENR
    <7db>   DW_AT_decl_file   : 5
    <7dc>   DW_AT_decl_line   : 476
    <7de>   DW_AT_decl_column : 17
    <7df>   DW_AT_type        : <0x2aa>
    <7e3>   DW_AT_data_member_location: 112
 <2><7e4>: Abbrev Number: 1 (DW_TAG_member)
    <7e5>   DW_AT_name        : (indirect string, offset: 0x85828): RESERVED4
    <7e9>   DW_AT_decl_file   : 5
    <7ea>   DW_AT_decl_line   : 477
    <7ec>   DW_AT_decl_column : 17
    <7ed>   DW_AT_type        : <0x29e>
    <7f1>   DW_AT_data_member_location: 116
 <2><7f2>: Abbrev Number: 1 (DW_TAG_member)
    <7f3>   DW_AT_name        : (indirect string, offset: 0x26431): APB1SMENR1
    <7f7>   DW_AT_decl_file   : 5
    <7f8>   DW_AT_decl_line   : 478
    <7fa>   DW_AT_decl_column : 17
    <7fb>   DW_AT_type        : <0x2aa>
    <7ff>   DW_AT_data_member_location: 120
 <2><800>: Abbrev Number: 1 (DW_TAG_member)
    <801>   DW_AT_name        : (indirect string, offset: 0x2643e): APB1SMENR2
    <805>   DW_AT_decl_file   : 5
    <806>   DW_AT_decl_line   : 479
    <808>   DW_AT_decl_column : 17
    <809>   DW_AT_type        : <0x2aa>
    <80d>   DW_AT_data_member_location: 124
 <2><80e>: Abbrev Number: 1 (DW_TAG_member)
    <80f>   DW_AT_name        : (indirect string, offset: 0x70e3f): APB2SMENR
    <813>   DW_AT_decl_file   : 5
    <814>   DW_AT_decl_line   : 480
    <816>   DW_AT_decl_column : 17
    <817>   DW_AT_type        : <0x2aa>
    <81b>   DW_AT_data_member_location: 128
 <2><81c>: Abbrev Number: 1 (DW_TAG_member)
    <81d>   DW_AT_name        : (indirect string, offset: 0x85860): RESERVED5
    <821>   DW_AT_decl_file   : 5
    <822>   DW_AT_decl_line   : 481
    <824>   DW_AT_decl_column : 17
    <825>   DW_AT_type        : <0x29e>
    <829>   DW_AT_data_member_location: 132
 <2><82a>: Abbrev Number: 1 (DW_TAG_member)
    <82b>   DW_AT_name        : (indirect string, offset: 0x444b1): CCIPR
    <82f>   DW_AT_decl_file   : 5
    <830>   DW_AT_decl_line   : 482
    <832>   DW_AT_decl_column : 17
    <833>   DW_AT_type        : <0x2aa>
    <837>   DW_AT_data_member_location: 136
 <2><838>: Abbrev Number: 1 (DW_TAG_member)
    <839>   DW_AT_name        : (indirect string, offset: 0xd3030): RESERVED6
    <83d>   DW_AT_decl_file   : 5
    <83e>   DW_AT_decl_line   : 483
    <840>   DW_AT_decl_column : 17
    <841>   DW_AT_type        : <0x29e>
    <845>   DW_AT_data_member_location: 140
 <2><846>: Abbrev Number: 1 (DW_TAG_member)
    <847>   DW_AT_name        : (indirect string, offset: 0x1ecfc): BDCR
    <84b>   DW_AT_decl_file   : 5
    <84c>   DW_AT_decl_line   : 484
    <84e>   DW_AT_decl_column : 17
    <84f>   DW_AT_type        : <0x2aa>
    <853>   DW_AT_data_member_location: 144
 <2><854>: Abbrev Number: 5 (DW_TAG_member)
    <855>   DW_AT_name        : CSR
    <859>   DW_AT_decl_file   : 5
    <85a>   DW_AT_decl_line   : 485
    <85c>   DW_AT_decl_column : 17
    <85d>   DW_AT_type        : <0x2aa>
    <861>   DW_AT_data_member_location: 148
 <2><862>: Abbrev Number: 1 (DW_TAG_member)
    <863>   DW_AT_name        : (indirect string, offset: 0x3cf2a): CRRCR
    <867>   DW_AT_decl_file   : 5
    <868>   DW_AT_decl_line   : 486
    <86a>   DW_AT_decl_column : 17
    <86b>   DW_AT_type        : <0x2aa>
    <86f>   DW_AT_data_member_location: 152
 <2><870>: Abbrev Number: 1 (DW_TAG_member)
    <871>   DW_AT_name        : (indirect string, offset: 0x3d900): HSECR
    <875>   DW_AT_decl_file   : 5
    <876>   DW_AT_decl_line   : 487
    <878>   DW_AT_decl_column : 17
    <879>   DW_AT_type        : <0x2aa>
    <87d>   DW_AT_data_member_location: 156
 <2><87e>: Abbrev Number: 1 (DW_TAG_member)
    <87f>   DW_AT_name        : (indirect string, offset: 0xd303a): RESERVED7
    <883>   DW_AT_decl_file   : 5
    <884>   DW_AT_decl_line   : 488
    <886>   DW_AT_decl_column : 17
    <887>   DW_AT_type        : <0x977>
    <88b>   DW_AT_data_member_location: 160
 <2><88c>: Abbrev Number: 10 (DW_TAG_member)
    <88d>   DW_AT_name        : (indirect string, offset: 0xd3400): EXTCFGR
    <891>   DW_AT_decl_file   : 5
    <891>   DW_AT_decl_line   : 489
    <893>   DW_AT_decl_column : 17
    <893>   DW_AT_type        : <0x2aa>
    <897>   DW_AT_data_member_location: 264
 <2><899>: Abbrev Number: 10 (DW_TAG_member)
    <89a>   DW_AT_name        : (indirect string, offset: 0xd3044): RESERVED8
    <89e>   DW_AT_decl_file   : 5
    <89e>   DW_AT_decl_line   : 490
    <8a0>   DW_AT_decl_column : 17
    <8a0>   DW_AT_type        : <0x2af>
    <8a4>   DW_AT_data_member_location: 268
 <2><8a6>: Abbrev Number: 10 (DW_TAG_member)
    <8a7>   DW_AT_name        : (indirect string, offset: 0xbc43f): C2AHB1ENR
    <8ab>   DW_AT_decl_file   : 5
    <8ab>   DW_AT_decl_line   : 491
    <8ad>   DW_AT_decl_column : 17
    <8ad>   DW_AT_type        : <0x2aa>
    <8b1>   DW_AT_data_member_location: 328
 <2><8b3>: Abbrev Number: 10 (DW_TAG_member)
    <8b4>   DW_AT_name        : (indirect string, offset: 0x9f4a9): C2AHB2ENR
    <8b8>   DW_AT_decl_file   : 5
    <8b8>   DW_AT_decl_line   : 492
    <8ba>   DW_AT_decl_column : 17
    <8ba>   DW_AT_type        : <0x2aa>
    <8be>   DW_AT_data_member_location: 332
 <2><8c0>: Abbrev Number: 10 (DW_TAG_member)
    <8c1>   DW_AT_name        : (indirect string, offset: 0xc8cf3): C2AHB3ENR
    <8c5>   DW_AT_decl_file   : 5
    <8c5>   DW_AT_decl_line   : 493
    <8c7>   DW_AT_decl_column : 17
    <8c7>   DW_AT_type        : <0x2aa>
    <8cb>   DW_AT_data_member_location: 336
 <2><8cd>: Abbrev Number: 10 (DW_TAG_member)
    <8ce>   DW_AT_name        : (indirect string, offset: 0xd304e): RESERVED9
    <8d2>   DW_AT_decl_file   : 5
    <8d2>   DW_AT_decl_line   : 494
    <8d4>   DW_AT_decl_column : 17
    <8d4>   DW_AT_type        : <0x29e>
    <8d8>   DW_AT_data_member_location: 340
 <2><8da>: Abbrev Number: 10 (DW_TAG_member)
    <8db>   DW_AT_name        : (indirect string, offset: 0x31ec5): C2APB1ENR1
    <8df>   DW_AT_decl_file   : 5
    <8df>   DW_AT_decl_line   : 495
    <8e1>   DW_AT_decl_column : 17
    <8e1>   DW_AT_type        : <0x2aa>
    <8e5>   DW_AT_data_member_location: 344
 <2><8e7>: Abbrev Number: 10 (DW_TAG_member)
    <8e8>   DW_AT_name        : (indirect string, offset: 0x31ed0): C2APB1ENR2
    <8ec>   DW_AT_decl_file   : 5
    <8ec>   DW_AT_decl_line   : 496
    <8ee>   DW_AT_decl_column : 17
    <8ee>   DW_AT_type        : <0x2aa>
    <8f2>   DW_AT_data_member_location: 348
 <2><8f4>: Abbrev Number: 10 (DW_TAG_member)
    <8f5>   DW_AT_name        : (indirect string, offset: 0x37709): C2APB2ENR
    <8f9>   DW_AT_decl_file   : 5
    <8f9>   DW_AT_decl_line   : 497
    <8fb>   DW_AT_decl_column : 17
    <8fb>   DW_AT_type        : <0x2aa>
    <8ff>   DW_AT_data_member_location: 352
 <2><901>: Abbrev Number: 10 (DW_TAG_member)
    <902>   DW_AT_name        : (indirect string, offset: 0x5fb3a): C2APB3ENR
    <906>   DW_AT_decl_file   : 5
    <906>   DW_AT_decl_line   : 498
    <908>   DW_AT_decl_column : 17
    <908>   DW_AT_type        : <0x2aa>
    <90c>   DW_AT_data_member_location: 356
 <2><90e>: Abbrev Number: 10 (DW_TAG_member)
    <90f>   DW_AT_name        : (indirect string, offset: 0x2c1f0): C2AHB1SMENR
    <913>   DW_AT_decl_file   : 5
    <913>   DW_AT_decl_line   : 499
    <915>   DW_AT_decl_column : 17
    <915>   DW_AT_type        : <0x2aa>
    <919>   DW_AT_data_member_location: 360
 <2><91b>: Abbrev Number: 10 (DW_TAG_member)
    <91c>   DW_AT_name        : (indirect string, offset: 0x91e6b): C2AHB2SMENR
    <920>   DW_AT_decl_file   : 5
    <920>   DW_AT_decl_line   : 500
    <922>   DW_AT_decl_column : 17
    <922>   DW_AT_type        : <0x2aa>
    <926>   DW_AT_data_member_location: 364
 <2><928>: Abbrev Number: 10 (DW_TAG_member)
    <929>   DW_AT_name        : (indirect string, offset: 0x16588): C2AHB3SMENR
    <92d>   DW_AT_decl_file   : 5
    <92d>   DW_AT_decl_line   : 501
    <92f>   DW_AT_decl_column : 17
    <92f>   DW_AT_type        : <0x2aa>
    <933>   DW_AT_data_member_location: 368
 <2><935>: Abbrev Number: 10 (DW_TAG_member)
    <936>   DW_AT_name        : (indirect string, offset: 0x1e38b): RESERVED10
    <93a>   DW_AT_decl_file   : 5
    <93a>   DW_AT_decl_line   : 502
    <93c>   DW_AT_decl_column : 17
    <93c>   DW_AT_type        : <0x29e>
    <940>   DW_AT_data_member_location: 372
 <2><942>: Abbrev Number: 10 (DW_TAG_member)
    <943>   DW_AT_name        : (indirect string, offset: 0x2642f): C2APB1SMENR1
    <947>   DW_AT_decl_file   : 5
    <947>   DW_AT_decl_line   : 503
    <949>   DW_AT_decl_column : 17
    <949>   DW_AT_type        : <0x2aa>
    <94d>   DW_AT_data_member_location: 376
 <2><94f>: Abbrev Number: 10 (DW_TAG_member)
    <950>   DW_AT_name        : (indirect string, offset: 0x2643c): C2APB1SMENR2
    <954>   DW_AT_decl_file   : 5
    <954>   DW_AT_decl_line   : 504
    <956>   DW_AT_decl_column : 17
    <956>   DW_AT_type        : <0x2aa>
    <95a>   DW_AT_data_member_location: 380
 <2><95c>: Abbrev Number: 10 (DW_TAG_member)
    <95d>   DW_AT_name        : (indirect string, offset: 0x70e3d): C2APB2SMENR
    <961>   DW_AT_decl_file   : 5
    <961>   DW_AT_decl_line   : 505
    <963>   DW_AT_decl_column : 17
    <963>   DW_AT_type        : <0x2aa>
    <967>   DW_AT_data_member_location: 384
 <2><969>: Abbrev Number: 10 (DW_TAG_member)
    <96a>   DW_AT_name        : (indirect string, offset: 0xd6831): C2APB3SMENR
    <96e>   DW_AT_decl_file   : 5
    <96e>   DW_AT_decl_line   : 506
    <970>   DW_AT_decl_column : 17
    <970>   DW_AT_type        : <0x2aa>
    <974>   DW_AT_data_member_location: 388
 <2><976>: Abbrev Number: 0
 <1><977>: Abbrev Number: 13 (DW_TAG_array_type)
    <978>   DW_AT_type        : <0x29e>
    <97c>   DW_AT_sibling     : <0x987>
 <2><980>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <981>   DW_AT_type        : <0x264>
    <985>   DW_AT_upper_bound : 25
 <2><986>: Abbrev Number: 0
 <1><987>: Abbrev Number: 9 (DW_TAG_typedef)
    <988>   DW_AT_name        : (indirect string, offset: 0x67c99): RCC_TypeDef
    <98c>   DW_AT_decl_file   : 5
    <98d>   DW_AT_decl_line   : 507
    <98f>   DW_AT_decl_column : 3
    <98f>   DW_AT_type        : <0x644>
 <1><993>: Abbrev Number: 11 (DW_TAG_structure_type)
    <994>   DW_AT_byte_size   : 104
    <995>   DW_AT_decl_file   : 5
    <996>   DW_AT_decl_line   : 609
    <998>   DW_AT_decl_column : 9
    <998>   DW_AT_sibling     : <0xb07>
 <2><99c>: Abbrev Number: 5 (DW_TAG_member)
    <99d>   DW_AT_name        : CR1
    <9a1>   DW_AT_decl_file   : 5
    <9a2>   DW_AT_decl_line   : 611
    <9a4>   DW_AT_decl_column : 17
    <9a5>   DW_AT_type        : <0x2aa>
    <9a9>   DW_AT_data_member_location: 0
 <2><9aa>: Abbrev Number: 5 (DW_TAG_member)
    <9ab>   DW_AT_name        : CR2
    <9af>   DW_AT_decl_file   : 5
    <9b0>   DW_AT_decl_line   : 612
    <9b2>   DW_AT_decl_column : 17
    <9b3>   DW_AT_type        : <0x2aa>
    <9b7>   DW_AT_data_member_location: 4
 <2><9b8>: Abbrev Number: 1 (DW_TAG_member)
    <9b9>   DW_AT_name        : (indirect string, offset: 0xc3986): SMCR
    <9bd>   DW_AT_decl_file   : 5
    <9be>   DW_AT_decl_line   : 613
    <9c0>   DW_AT_decl_column : 17
    <9c1>   DW_AT_type        : <0x2aa>
    <9c5>   DW_AT_data_member_location: 8
 <2><9c6>: Abbrev Number: 1 (DW_TAG_member)
    <9c7>   DW_AT_name        : (indirect string, offset: 0x497b8): DIER
    <9cb>   DW_AT_decl_file   : 5
    <9cc>   DW_AT_decl_line   : 614
    <9ce>   DW_AT_decl_column : 17
    <9cf>   DW_AT_type        : <0x2aa>
    <9d3>   DW_AT_data_member_location: 12
 <2><9d4>: Abbrev Number: 5 (DW_TAG_member)
    <9d5>   DW_AT_name        : SR
    <9d8>   DW_AT_decl_file   : 5
    <9d9>   DW_AT_decl_line   : 615
    <9db>   DW_AT_decl_column : 17
    <9dc>   DW_AT_type        : <0x2aa>
    <9e0>   DW_AT_data_member_location: 16
 <2><9e1>: Abbrev Number: 5 (DW_TAG_member)
    <9e2>   DW_AT_name        : EGR
    <9e6>   DW_AT_decl_file   : 5
    <9e7>   DW_AT_decl_line   : 616
    <9e9>   DW_AT_decl_column : 17
    <9ea>   DW_AT_type        : <0x2aa>
    <9ee>   DW_AT_data_member_location: 20
 <2><9ef>: Abbrev Number: 1 (DW_TAG_member)
    <9f0>   DW_AT_name        : (indirect string, offset: 0xa3fd4): CCMR1
    <9f4>   DW_AT_decl_file   : 5
    <9f5>   DW_AT_decl_line   : 617
    <9f7>   DW_AT_decl_column : 17
    <9f8>   DW_AT_type        : <0x2aa>
    <9fc>   DW_AT_data_member_location: 24
 <2><9fd>: Abbrev Number: 1 (DW_TAG_member)
    <9fe>   DW_AT_name        : (indirect string, offset: 0x5936a): CCMR2
    <a02>   DW_AT_decl_file   : 5
    <a03>   DW_AT_decl_line   : 618
    <a05>   DW_AT_decl_column : 17
    <a06>   DW_AT_type        : <0x2aa>
    <a0a>   DW_AT_data_member_location: 28
 <2><a0b>: Abbrev Number: 1 (DW_TAG_member)
    <a0c>   DW_AT_name        : (indirect string, offset: 0x36a3b): CCER
    <a10>   DW_AT_decl_file   : 5
    <a11>   DW_AT_decl_line   : 619
    <a13>   DW_AT_decl_column : 17
    <a14>   DW_AT_type        : <0x2aa>
    <a18>   DW_AT_data_member_location: 32
 <2><a19>: Abbrev Number: 5 (DW_TAG_member)
    <a1a>   DW_AT_name        : CNT
    <a1e>   DW_AT_decl_file   : 5
    <a1f>   DW_AT_decl_line   : 620
    <a21>   DW_AT_decl_column : 17
    <a22>   DW_AT_type        : <0x2aa>
    <a26>   DW_AT_data_member_location: 36
 <2><a27>: Abbrev Number: 5 (DW_TAG_member)
    <a28>   DW_AT_name        : PSC
    <a2c>   DW_AT_decl_file   : 5
    <a2d>   DW_AT_decl_line   : 621
    <a2f>   DW_AT_decl_column : 17
    <a30>   DW_AT_type        : <0x2aa>
    <a34>   DW_AT_data_member_location: 40
 <2><a35>: Abbrev Number: 5 (DW_TAG_member)
    <a36>   DW_AT_name        : ARR
    <a3a>   DW_AT_decl_file   : 5
    <a3b>   DW_AT_decl_line   : 622
    <a3d>   DW_AT_decl_column : 17
    <a3e>   DW_AT_type        : <0x2aa>
    <a42>   DW_AT_data_member_location: 44
 <2><a43>: Abbrev Number: 5 (DW_TAG_member)
    <a44>   DW_AT_name        : RCR
    <a48>   DW_AT_decl_file   : 5
    <a49>   DW_AT_decl_line   : 623
    <a4b>   DW_AT_decl_column : 17
    <a4c>   DW_AT_type        : <0x2aa>
    <a50>   DW_AT_data_member_location: 48
 <2><a51>: Abbrev Number: 1 (DW_TAG_member)
    <a52>   DW_AT_name        : (indirect string, offset: 0x1a773): CCR1
    <a56>   DW_AT_decl_file   : 5
    <a57>   DW_AT_decl_line   : 624
    <a59>   DW_AT_decl_column : 17
    <a5a>   DW_AT_type        : <0x2aa>
    <a5e>   DW_AT_data_member_location: 52
 <2><a5f>: Abbrev Number: 1 (DW_TAG_member)
    <a60>   DW_AT_name        : (indirect string, offset: 0x5d6ac): CCR2
    <a64>   DW_AT_decl_file   : 5
    <a65>   DW_AT_decl_line   : 625
    <a67>   DW_AT_decl_column : 17
    <a68>   DW_AT_type        : <0x2aa>
    <a6c>   DW_AT_data_member_location: 56
 <2><a6d>: Abbrev Number: 1 (DW_TAG_member)
    <a6e>   DW_AT_name        : (indirect string, offset: 0xb5c9b): CCR3
    <a72>   DW_AT_decl_file   : 5
    <a73>   DW_AT_decl_line   : 626
    <a75>   DW_AT_decl_column : 17
    <a76>   DW_AT_type        : <0x2aa>
    <a7a>   DW_AT_data_member_location: 60
 <2><a7b>: Abbrev Number: 1 (DW_TAG_member)
    <a7c>   DW_AT_name        : (indirect string, offset: 0xb929): CCR4
    <a80>   DW_AT_decl_file   : 5
    <a81>   DW_AT_decl_line   : 627
    <a83>   DW_AT_decl_column : 17
    <a84>   DW_AT_type        : <0x2aa>
    <a88>   DW_AT_data_member_location: 64
 <2><a89>: Abbrev Number: 1 (DW_TAG_member)
    <a8a>   DW_AT_name        : (indirect string, offset: 0x6728c): BDTR
    <a8e>   DW_AT_decl_file   : 5
    <a8f>   DW_AT_decl_line   : 628
    <a91>   DW_AT_decl_column : 17
    <a92>   DW_AT_type        : <0x2aa>
    <a96>   DW_AT_data_member_location: 68
 <2><a97>: Abbrev Number: 5 (DW_TAG_member)
    <a98>   DW_AT_name        : DCR
    <a9c>   DW_AT_decl_file   : 5
    <a9d>   DW_AT_decl_line   : 629
    <a9f>   DW_AT_decl_column : 17
    <aa0>   DW_AT_type        : <0x2aa>
    <aa4>   DW_AT_data_member_location: 72
 <2><aa5>: Abbrev Number: 1 (DW_TAG_member)
    <aa6>   DW_AT_name        : (indirect string, offset: 0x47d83): DMAR
    <aaa>   DW_AT_decl_file   : 5
    <aab>   DW_AT_decl_line   : 630
    <aad>   DW_AT_decl_column : 17
    <aae>   DW_AT_type        : <0x2aa>
    <ab2>   DW_AT_data_member_location: 76
 <2><ab3>: Abbrev Number: 5 (DW_TAG_member)
    <ab4>   DW_AT_name        : OR
    <ab7>   DW_AT_decl_file   : 5
    <ab8>   DW_AT_decl_line   : 631
    <aba>   DW_AT_decl_column : 17
    <abb>   DW_AT_type        : <0x2aa>
    <abf>   DW_AT_data_member_location: 80
 <2><ac0>: Abbrev Number: 1 (DW_TAG_member)
    <ac1>   DW_AT_name        : (indirect string, offset: 0xc7914): CCMR3
    <ac5>   DW_AT_decl_file   : 5
    <ac6>   DW_AT_decl_line   : 632
    <ac8>   DW_AT_decl_column : 17
    <ac9>   DW_AT_type        : <0x2aa>
    <acd>   DW_AT_data_member_location: 84
 <2><ace>: Abbrev Number: 1 (DW_TAG_member)
    <acf>   DW_AT_name        : (indirect string, offset: 0x50e2f): CCR5
    <ad3>   DW_AT_decl_file   : 5
    <ad4>   DW_AT_decl_line   : 633
    <ad6>   DW_AT_decl_column : 17
    <ad7>   DW_AT_type        : <0x2aa>
    <adb>   DW_AT_data_member_location: 88
 <2><adc>: Abbrev Number: 1 (DW_TAG_member)
    <add>   DW_AT_name        : (indirect string, offset: 0x9e75a): CCR6
    <ae1>   DW_AT_decl_file   : 5
    <ae2>   DW_AT_decl_line   : 634
    <ae4>   DW_AT_decl_column : 17
    <ae5>   DW_AT_type        : <0x2aa>
    <ae9>   DW_AT_data_member_location: 92
 <2><aea>: Abbrev Number: 5 (DW_TAG_member)
    <aeb>   DW_AT_name        : AF1
    <aef>   DW_AT_decl_file   : 5
    <af0>   DW_AT_decl_line   : 635
    <af2>   DW_AT_decl_column : 17
    <af3>   DW_AT_type        : <0x2aa>
    <af7>   DW_AT_data_member_location: 96
 <2><af8>: Abbrev Number: 5 (DW_TAG_member)
    <af9>   DW_AT_name        : AF2
    <afd>   DW_AT_decl_file   : 5
    <afe>   DW_AT_decl_line   : 636
    <b00>   DW_AT_decl_column : 17
    <b01>   DW_AT_type        : <0x2aa>
    <b05>   DW_AT_data_member_location: 100
 <2><b06>: Abbrev Number: 0
 <1><b07>: Abbrev Number: 9 (DW_TAG_typedef)
    <b08>   DW_AT_name        : (indirect string, offset: 0xd3dce): TIM_TypeDef
    <b0c>   DW_AT_decl_file   : 5
    <b0d>   DW_AT_decl_line   : 637
    <b0f>   DW_AT_decl_column : 3
    <b0f>   DW_AT_type        : <0x993>
 <1><b13>: Abbrev Number: 11 (DW_TAG_structure_type)
    <b14>   DW_AT_byte_size   : 48
    <b15>   DW_AT_decl_file   : 5
    <b16>   DW_AT_decl_line   : 642
    <b18>   DW_AT_decl_column : 9
    <b18>   DW_AT_sibling     : <0xbc5>
 <2><b1c>: Abbrev Number: 5 (DW_TAG_member)
    <b1d>   DW_AT_name        : CR1
    <b21>   DW_AT_decl_file   : 5
    <b22>   DW_AT_decl_line   : 644
    <b24>   DW_AT_decl_column : 17
    <b25>   DW_AT_type        : <0x2aa>
    <b29>   DW_AT_data_member_location: 0
 <2><b2a>: Abbrev Number: 5 (DW_TAG_member)
    <b2b>   DW_AT_name        : CR2
    <b2f>   DW_AT_decl_file   : 5
    <b30>   DW_AT_decl_line   : 645
    <b32>   DW_AT_decl_column : 17
    <b33>   DW_AT_type        : <0x2aa>
    <b37>   DW_AT_data_member_location: 4
 <2><b38>: Abbrev Number: 5 (DW_TAG_member)
    <b39>   DW_AT_name        : CR3
    <b3d>   DW_AT_decl_file   : 5
    <b3e>   DW_AT_decl_line   : 646
    <b40>   DW_AT_decl_column : 17
    <b41>   DW_AT_type        : <0x2aa>
    <b45>   DW_AT_data_member_location: 8
 <2><b46>: Abbrev Number: 5 (DW_TAG_member)
    <b47>   DW_AT_name        : BRR
    <b4b>   DW_AT_decl_file   : 5
    <b4c>   DW_AT_decl_line   : 647
    <b4e>   DW_AT_decl_column : 17
    <b4f>   DW_AT_type        : <0x2aa>
    <b53>   DW_AT_data_member_location: 12
 <2><b54>: Abbrev Number: 1 (DW_TAG_member)
    <b55>   DW_AT_name        : (indirect string, offset: 0x3e5df): GTPR
    <b59>   DW_AT_decl_file   : 5
    <b5a>   DW_AT_decl_line   : 648
    <b5c>   DW_AT_decl_column : 17
    <b5d>   DW_AT_type        : <0x2aa>
    <b61>   DW_AT_data_member_location: 16
 <2><b62>: Abbrev Number: 1 (DW_TAG_member)
    <b63>   DW_AT_name        : (indirect string, offset: 0x42683): RTOR
    <b67>   DW_AT_decl_file   : 5
    <b68>   DW_AT_decl_line   : 649
    <b6a>   DW_AT_decl_column : 17
    <b6b>   DW_AT_type        : <0x2aa>
    <b6f>   DW_AT_data_member_location: 20
 <2><b70>: Abbrev Number: 5 (DW_TAG_member)
    <b71>   DW_AT_name        : RQR
    <b75>   DW_AT_decl_file   : 5
    <b76>   DW_AT_decl_line   : 650
    <b78>   DW_AT_decl_column : 17
    <b79>   DW_AT_type        : <0x2aa>
    <b7d>   DW_AT_data_member_location: 24
 <2><b7e>: Abbrev Number: 5 (DW_TAG_member)
    <b7f>   DW_AT_name        : ISR
    <b83>   DW_AT_decl_file   : 5
    <b84>   DW_AT_decl_line   : 651
    <b86>   DW_AT_decl_column : 17
    <b87>   DW_AT_type        : <0x2aa>
    <b8b>   DW_AT_data_member_location: 28
 <2><b8c>: Abbrev Number: 5 (DW_TAG_member)
    <b8d>   DW_AT_name        : ICR
    <b91>   DW_AT_decl_file   : 5
    <b92>   DW_AT_decl_line   : 652
    <b94>   DW_AT_decl_column : 17
    <b95>   DW_AT_type        : <0x2aa>
    <b99>   DW_AT_data_member_location: 32
 <2><b9a>: Abbrev Number: 5 (DW_TAG_member)
    <b9b>   DW_AT_name        : RDR
    <b9f>   DW_AT_decl_file   : 5
    <ba0>   DW_AT_decl_line   : 653
    <ba2>   DW_AT_decl_column : 17
    <ba3>   DW_AT_type        : <0x2aa>
    <ba7>   DW_AT_data_member_location: 36
 <2><ba8>: Abbrev Number: 5 (DW_TAG_member)
    <ba9>   DW_AT_name        : TDR
    <bad>   DW_AT_decl_file   : 5
    <bae>   DW_AT_decl_line   : 654
    <bb0>   DW_AT_decl_column : 17
    <bb1>   DW_AT_type        : <0x2aa>
    <bb5>   DW_AT_data_member_location: 40
 <2><bb6>: Abbrev Number: 1 (DW_TAG_member)
    <bb7>   DW_AT_name        : (indirect string, offset: 0x991b9): PRESC
    <bbb>   DW_AT_decl_file   : 5
    <bbc>   DW_AT_decl_line   : 655
    <bbe>   DW_AT_decl_column : 17
    <bbf>   DW_AT_type        : <0x2aa>
    <bc3>   DW_AT_data_member_location: 44
 <2><bc4>: Abbrev Number: 0
 <1><bc5>: Abbrev Number: 9 (DW_TAG_typedef)
    <bc6>   DW_AT_name        : (indirect string, offset: 0xde24d): USART_TypeDef
    <bca>   DW_AT_decl_file   : 5
    <bcb>   DW_AT_decl_line   : 656
    <bcd>   DW_AT_decl_column : 3
    <bcd>   DW_AT_type        : <0xb13>
 <1><bd1>: Abbrev Number: 11 (DW_TAG_structure_type)
    <bd2>   DW_AT_byte_size   : 92
    <bd3>   DW_AT_decl_file   : 5
    <bd4>   DW_AT_decl_line   : 748
    <bd6>   DW_AT_decl_column : 9
    <bd6>   DW_AT_sibling     : <0xd7f>
 <2><bda>: Abbrev Number: 1 (DW_TAG_member)
    <bdb>   DW_AT_name        : (indirect string, offset: 0xc093e): EP0R
    <bdf>   DW_AT_decl_file   : 5
    <be0>   DW_AT_decl_line   : 750
    <be2>   DW_AT_decl_column : 17
    <be3>   DW_AT_type        : <0x299>
    <be7>   DW_AT_data_member_location: 0
 <2><be8>: Abbrev Number: 1 (DW_TAG_member)
    <be9>   DW_AT_name        : (indirect string, offset: 0xd2f9b): RESERVED0
    <bed>   DW_AT_decl_file   : 5
    <bee>   DW_AT_decl_line   : 751
    <bf0>   DW_AT_decl_column : 17
    <bf1>   DW_AT_type        : <0x299>
    <bf5>   DW_AT_data_member_location: 2
 <2><bf6>: Abbrev Number: 1 (DW_TAG_member)
    <bf7>   DW_AT_name        : (indirect string, offset: 0x4265c): EP1R
    <bfb>   DW_AT_decl_file   : 5
    <bfc>   DW_AT_decl_line   : 752
    <bfe>   DW_AT_decl_column : 17
    <bff>   DW_AT_type        : <0x299>
    <c03>   DW_AT_data_member_location: 4
 <2><c04>: Abbrev Number: 1 (DW_TAG_member)
    <c05>   DW_AT_name        : (indirect string, offset: 0xd2fa5): RESERVED1
    <c09>   DW_AT_decl_file   : 5
    <c0a>   DW_AT_decl_line   : 753
    <c0c>   DW_AT_decl_column : 17
    <c0d>   DW_AT_type        : <0x299>
    <c11>   DW_AT_data_member_location: 6
 <2><c12>: Abbrev Number: 1 (DW_TAG_member)
    <c13>   DW_AT_name        : (indirect string, offset: 0x42dc7): EP2R
    <c17>   DW_AT_decl_file   : 5
    <c18>   DW_AT_decl_line   : 754
    <c1a>   DW_AT_decl_column : 17
    <c1b>   DW_AT_type        : <0x299>
    <c1f>   DW_AT_data_member_location: 8
 <2><c20>: Abbrev Number: 1 (DW_TAG_member)
    <c21>   DW_AT_name        : (indirect string, offset: 0xd2faf): RESERVED2
    <c25>   DW_AT_decl_file   : 5
    <c26>   DW_AT_decl_line   : 755
    <c28>   DW_AT_decl_column : 17
    <c29>   DW_AT_type        : <0x299>
    <c2d>   DW_AT_data_member_location: 10
 <2><c2e>: Abbrev Number: 1 (DW_TAG_member)
    <c2f>   DW_AT_name        : (indirect string, offset: 0x433a6): EP3R
    <c33>   DW_AT_decl_file   : 5
    <c34>   DW_AT_decl_line   : 756
    <c36>   DW_AT_decl_column : 17
    <c37>   DW_AT_type        : <0x299>
    <c3b>   DW_AT_data_member_location: 12
 <2><c3c>: Abbrev Number: 1 (DW_TAG_member)
    <c3d>   DW_AT_name        : (indirect string, offset: 0x857ee): RESERVED3
    <c41>   DW_AT_decl_file   : 5
    <c42>   DW_AT_decl_line   : 757
    <c44>   DW_AT_decl_column : 17
    <c45>   DW_AT_type        : <0x299>
    <c49>   DW_AT_data_member_location: 14
 <2><c4a>: Abbrev Number: 1 (DW_TAG_member)
    <c4b>   DW_AT_name        : (indirect string, offset: 0x43c38): EP4R
    <c4f>   DW_AT_decl_file   : 5
    <c50>   DW_AT_decl_line   : 758
    <c52>   DW_AT_decl_column : 17
    <c53>   DW_AT_type        : <0x299>
    <c57>   DW_AT_data_member_location: 16
 <2><c58>: Abbrev Number: 1 (DW_TAG_member)
    <c59>   DW_AT_name        : (indirect string, offset: 0x85828): RESERVED4
    <c5d>   DW_AT_decl_file   : 5
    <c5e>   DW_AT_decl_line   : 759
    <c60>   DW_AT_decl_column : 17
    <c61>   DW_AT_type        : <0x299>
    <c65>   DW_AT_data_member_location: 18
 <2><c66>: Abbrev Number: 1 (DW_TAG_member)
    <c67>   DW_AT_name        : (indirect string, offset: 0x447a6): EP5R
    <c6b>   DW_AT_decl_file   : 5
    <c6c>   DW_AT_decl_line   : 760
    <c6e>   DW_AT_decl_column : 17
    <c6f>   DW_AT_type        : <0x299>
    <c73>   DW_AT_data_member_location: 20
 <2><c74>: Abbrev Number: 1 (DW_TAG_member)
    <c75>   DW_AT_name        : (indirect string, offset: 0x85860): RESERVED5
    <c79>   DW_AT_decl_file   : 5
    <c7a>   DW_AT_decl_line   : 761
    <c7c>   DW_AT_decl_column : 17
    <c7d>   DW_AT_type        : <0x299>
    <c81>   DW_AT_data_member_location: 22
 <2><c82>: Abbrev Number: 1 (DW_TAG_member)
    <c83>   DW_AT_name        : (indirect string, offset: 0x44fd8): EP6R
    <c87>   DW_AT_decl_file   : 5
    <c88>   DW_AT_decl_line   : 762
    <c8a>   DW_AT_decl_column : 17
    <c8b>   DW_AT_type        : <0x299>
    <c8f>   DW_AT_data_member_location: 24
 <2><c90>: Abbrev Number: 1 (DW_TAG_member)
    <c91>   DW_AT_name        : (indirect string, offset: 0xd3030): RESERVED6
    <c95>   DW_AT_decl_file   : 5
    <c96>   DW_AT_decl_line   : 763
    <c98>   DW_AT_decl_column : 17
    <c99>   DW_AT_type        : <0x299>
    <c9d>   DW_AT_data_member_location: 26
 <2><c9e>: Abbrev Number: 1 (DW_TAG_member)
    <c9f>   DW_AT_name        : (indirect string, offset: 0x4578c): EP7R
    <ca3>   DW_AT_decl_file   : 5
    <ca4>   DW_AT_decl_line   : 764
    <ca6>   DW_AT_decl_column : 17
    <ca7>   DW_AT_type        : <0x299>
    <cab>   DW_AT_data_member_location: 28
 <2><cac>: Abbrev Number: 1 (DW_TAG_member)
    <cad>   DW_AT_name        : (indirect string, offset: 0xd303a): RESERVED7
    <cb1>   DW_AT_decl_file   : 5
    <cb2>   DW_AT_decl_line   : 765
    <cb4>   DW_AT_decl_column : 17
    <cb5>   DW_AT_type        : <0xd8f>
    <cb9>   DW_AT_data_member_location: 30
 <2><cba>: Abbrev Number: 1 (DW_TAG_member)
    <cbb>   DW_AT_name        : (indirect string, offset: 0xa3619): CNTR
    <cbf>   DW_AT_decl_file   : 5
    <cc0>   DW_AT_decl_line   : 766
    <cc2>   DW_AT_decl_column : 17
    <cc3>   DW_AT_type        : <0x299>
    <cc7>   DW_AT_data_member_location: 64
 <2><cc8>: Abbrev Number: 1 (DW_TAG_member)
    <cc9>   DW_AT_name        : (indirect string, offset: 0xd3044): RESERVED8
    <ccd>   DW_AT_decl_file   : 5
    <cce>   DW_AT_decl_line   : 767
    <cd0>   DW_AT_decl_column : 17
    <cd1>   DW_AT_type        : <0x299>
    <cd5>   DW_AT_data_member_location: 66
 <2><cd6>: Abbrev Number: 1 (DW_TAG_member)
    <cd7>   DW_AT_name        : (indirect string, offset: 0x741d6): ISTR
    <cdb>   DW_AT_decl_file   : 5
    <cdc>   DW_AT_decl_line   : 768
    <cde>   DW_AT_decl_column : 17
    <cdf>   DW_AT_type        : <0x299>
    <ce3>   DW_AT_data_member_location: 68
 <2><ce4>: Abbrev Number: 1 (DW_TAG_member)
    <ce5>   DW_AT_name        : (indirect string, offset: 0xd304e): RESERVED9
    <ce9>   DW_AT_decl_file   : 5
    <cea>   DW_AT_decl_line   : 769
    <cec>   DW_AT_decl_column : 17
    <ced>   DW_AT_type        : <0x299>
    <cf1>   DW_AT_data_member_location: 70
 <2><cf2>: Abbrev Number: 5 (DW_TAG_member)
    <cf3>   DW_AT_name        : FNR
    <cf7>   DW_AT_decl_file   : 5
    <cf8>   DW_AT_decl_line   : 770
    <cfa>   DW_AT_decl_column : 17
    <cfb>   DW_AT_type        : <0x299>
    <cff>   DW_AT_data_member_location: 72
 <2><d00>: Abbrev Number: 1 (DW_TAG_member)
    <d01>   DW_AT_name        : (indirect string, offset: 0xd30d1): RESERVEDA
    <d05>   DW_AT_decl_file   : 5
    <d06>   DW_AT_decl_line   : 771
    <d08>   DW_AT_decl_column : 17
    <d09>   DW_AT_type        : <0x299>
    <d0d>   DW_AT_data_member_location: 74
 <2><d0e>: Abbrev Number: 1 (DW_TAG_member)
    <d0f>   DW_AT_name        : (indirect string, offset: 0x56aca): DADDR
    <d13>   DW_AT_decl_file   : 5
    <d14>   DW_AT_decl_line   : 772
    <d16>   DW_AT_decl_column : 17
    <d17>   DW_AT_type        : <0x299>
    <d1b>   DW_AT_data_member_location: 76
 <2><d1c>: Abbrev Number: 1 (DW_TAG_member)
    <d1d>   DW_AT_name        : (indirect string, offset: 0xd30db): RESERVEDB
    <d21>   DW_AT_decl_file   : 5
    <d22>   DW_AT_decl_line   : 773
    <d24>   DW_AT_decl_column : 17
    <d25>   DW_AT_type        : <0x299>
    <d29>   DW_AT_data_member_location: 78
 <2><d2a>: Abbrev Number: 1 (DW_TAG_member)
    <d2b>   DW_AT_name        : (indirect string, offset: 0x26d16): BTABLE
    <d2f>   DW_AT_decl_file   : 5
    <d30>   DW_AT_decl_line   : 774
    <d32>   DW_AT_decl_column : 17
    <d33>   DW_AT_type        : <0x299>
    <d37>   DW_AT_data_member_location: 80
 <2><d38>: Abbrev Number: 1 (DW_TAG_member)
    <d39>   DW_AT_name        : (indirect string, offset: 0x85b62): RESERVEDC
    <d3d>   DW_AT_decl_file   : 5
    <d3e>   DW_AT_decl_line   : 775
    <d40>   DW_AT_decl_column : 17
    <d41>   DW_AT_type        : <0x299>
    <d45>   DW_AT_data_member_location: 82
 <2><d46>: Abbrev Number: 1 (DW_TAG_member)
    <d47>   DW_AT_name        : (indirect string, offset: 0x309d5): LPMCSR
    <d4b>   DW_AT_decl_file   : 5
    <d4c>   DW_AT_decl_line   : 776
    <d4e>   DW_AT_decl_column : 17
    <d4f>   DW_AT_type        : <0x299>
    <d53>   DW_AT_data_member_location: 84
 <2><d54>: Abbrev Number: 1 (DW_TAG_member)
    <d55>   DW_AT_name        : (indirect string, offset: 0xd310d): RESERVEDD
    <d59>   DW_AT_decl_file   : 5
    <d5a>   DW_AT_decl_line   : 777
    <d5c>   DW_AT_decl_column : 17
    <d5d>   DW_AT_type        : <0x299>
    <d61>   DW_AT_data_member_location: 86
 <2><d62>: Abbrev Number: 1 (DW_TAG_member)
    <d63>   DW_AT_name        : (indirect string, offset: 0xc24): BCDR
    <d67>   DW_AT_decl_file   : 5
    <d68>   DW_AT_decl_line   : 778
    <d6a>   DW_AT_decl_column : 17
    <d6b>   DW_AT_type        : <0x299>
    <d6f>   DW_AT_data_member_location: 88
 <2><d70>: Abbrev Number: 1 (DW_TAG_member)
    <d71>   DW_AT_name        : (indirect string, offset: 0xd3117): RESERVEDE
    <d75>   DW_AT_decl_file   : 5
    <d76>   DW_AT_decl_line   : 779
    <d78>   DW_AT_decl_column : 17
    <d79>   DW_AT_type        : <0x299>
    <d7d>   DW_AT_data_member_location: 90
 <2><d7e>: Abbrev Number: 0
 <1><d7f>: Abbrev Number: 13 (DW_TAG_array_type)
    <d80>   DW_AT_type        : <0x299>
    <d84>   DW_AT_sibling     : <0xd8f>
 <2><d88>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <d89>   DW_AT_type        : <0x264>
    <d8d>   DW_AT_upper_bound : 16
 <2><d8e>: Abbrev Number: 0
 <1><d8f>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <d90>   DW_AT_type        : <0xd7f>
 <1><d94>: Abbrev Number: 9 (DW_TAG_typedef)
    <d95>   DW_AT_name        : (indirect string, offset: 0xbff93): USB_TypeDef
    <d99>   DW_AT_decl_file   : 5
    <d9a>   DW_AT_decl_line   : 780
    <d9c>   DW_AT_decl_column : 3
    <d9c>   DW_AT_type        : <0xbd1>
 <1><da0>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <da1>   DW_AT_encoding    : 7	(unsigned)
    <da2>   DW_AT_byte_size   : 1
    <da3>   DW_AT_type        : <0x214>
    <da7>   DW_AT_decl_file   : 8
    <da8>   DW_AT_decl_line   : 120
    <da9>   DW_AT_decl_column : 1
    <daa>   DW_AT_sibling     : <0xdbb>
 <2><dae>: Abbrev Number: 2 (DW_TAG_enumerator)
    <daf>   DW_AT_name        : (indirect string, offset: 0x6a136): DISABLE
    <db3>   DW_AT_const_value : 0
 <2><db4>: Abbrev Number: 2 (DW_TAG_enumerator)
    <db5>   DW_AT_name        : (indirect string, offset: 0x73bf): ENABLE
    <db9>   DW_AT_const_value : 1
 <2><dba>: Abbrev Number: 0
 <1><dbb>: Abbrev Number: 16 (DW_TAG_base_type)
    <dbc>   DW_AT_byte_size   : 8
    <dbd>   DW_AT_encoding    : 4	(float)
    <dbe>   DW_AT_name        : (indirect string, offset: 0x14126): long double
 <1><dc2>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <dc3>   DW_AT_encoding    : 7	(unsigned)
    <dc4>   DW_AT_byte_size   : 1
    <dc5>   DW_AT_type        : <0x214>
    <dc9>   DW_AT_decl_file   : 9
    <dca>   DW_AT_decl_line   : 39
    <dcb>   DW_AT_decl_column : 1
    <dcc>   DW_AT_sibling     : <0xde9>
 <2><dd0>: Abbrev Number: 2 (DW_TAG_enumerator)
    <dd1>   DW_AT_name        : (indirect string, offset: 0x4b1ed): HAL_OK
    <dd5>   DW_AT_const_value : 0
 <2><dd6>: Abbrev Number: 2 (DW_TAG_enumerator)
    <dd7>   DW_AT_name        : (indirect string, offset: 0x8c495): HAL_ERROR
    <ddb>   DW_AT_const_value : 1
 <2><ddc>: Abbrev Number: 2 (DW_TAG_enumerator)
    <ddd>   DW_AT_name        : (indirect string, offset: 0x26d7c): HAL_BUSY
    <de1>   DW_AT_const_value : 2
 <2><de2>: Abbrev Number: 2 (DW_TAG_enumerator)
    <de3>   DW_AT_name        : (indirect string, offset: 0x41781): HAL_TIMEOUT
    <de7>   DW_AT_const_value : 3
 <2><de8>: Abbrev Number: 0
 <1><de9>: Abbrev Number: 4 (DW_TAG_typedef)
    <dea>   DW_AT_name        : (indirect string, offset: 0xd60b1): HAL_StatusTypeDef
    <dee>   DW_AT_decl_file   : 9
    <def>   DW_AT_decl_line   : 44
    <df0>   DW_AT_decl_column : 3
    <df1>   DW_AT_type        : <0xdc2>
 <1><df5>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <df6>   DW_AT_encoding    : 7	(unsigned)
    <df7>   DW_AT_byte_size   : 1
    <df8>   DW_AT_type        : <0x214>
    <dfc>   DW_AT_decl_file   : 9
    <dfd>   DW_AT_decl_line   : 50
    <dfe>   DW_AT_decl_column : 1
    <dff>   DW_AT_sibling     : <0xe10>
 <2><e03>: Abbrev Number: 2 (DW_TAG_enumerator)
    <e04>   DW_AT_name        : (indirect string, offset: 0xa5bb3): HAL_UNLOCKED
    <e08>   DW_AT_const_value : 0
 <2><e09>: Abbrev Number: 2 (DW_TAG_enumerator)
    <e0a>   DW_AT_name        : (indirect string, offset: 0xdfdf9): HAL_LOCKED
    <e0e>   DW_AT_const_value : 1
 <2><e0f>: Abbrev Number: 0
 <1><e10>: Abbrev Number: 4 (DW_TAG_typedef)
    <e11>   DW_AT_name        : (indirect string, offset: 0x88d1c): HAL_LockTypeDef
    <e15>   DW_AT_decl_file   : 9
    <e16>   DW_AT_decl_line   : 53
    <e17>   DW_AT_decl_column : 3
    <e18>   DW_AT_type        : <0xdf5>
 <1><e1c>: Abbrev Number: 18 (DW_TAG_structure_type)
    <e1d>   DW_AT_byte_size   : 32
    <e1e>   DW_AT_decl_file   : 10
    <e1f>   DW_AT_decl_line   : 47
    <e20>   DW_AT_decl_column : 9
    <e20>   DW_AT_sibling     : <0xe8d>
 <2><e24>: Abbrev Number: 3 (DW_TAG_member)
    <e25>   DW_AT_name        : (indirect string, offset: 0xe7703): Request
    <e29>   DW_AT_decl_file   : 10
    <e2a>   DW_AT_decl_line   : 49
    <e2b>   DW_AT_decl_column : 12
    <e2c>   DW_AT_type        : <0x29e>
    <e30>   DW_AT_data_member_location: 0
 <2><e31>: Abbrev Number: 3 (DW_TAG_member)
    <e32>   DW_AT_name        : (indirect string, offset: 0xe432e): Direction
    <e36>   DW_AT_decl_file   : 10
    <e37>   DW_AT_decl_line   : 52
    <e38>   DW_AT_decl_column : 12
    <e39>   DW_AT_type        : <0x29e>
    <e3d>   DW_AT_data_member_location: 4
 <2><e3e>: Abbrev Number: 3 (DW_TAG_member)
    <e3f>   DW_AT_name        : (indirect string, offset: 0xecd8): PeriphInc
    <e43>   DW_AT_decl_file   : 10
    <e44>   DW_AT_decl_line   : 56
    <e45>   DW_AT_decl_column : 12
    <e46>   DW_AT_type        : <0x29e>
    <e4a>   DW_AT_data_member_location: 8
 <2><e4b>: Abbrev Number: 3 (DW_TAG_member)
    <e4c>   DW_AT_name        : (indirect string, offset: 0x22b86): MemInc
    <e50>   DW_AT_decl_file   : 10
    <e51>   DW_AT_decl_line   : 59
    <e52>   DW_AT_decl_column : 12
    <e53>   DW_AT_type        : <0x29e>
    <e57>   DW_AT_data_member_location: 12
 <2><e58>: Abbrev Number: 3 (DW_TAG_member)
    <e59>   DW_AT_name        : (indirect string, offset: 0x6faa2): PeriphDataAlignment
    <e5d>   DW_AT_decl_file   : 10
    <e5e>   DW_AT_decl_line   : 62
    <e5f>   DW_AT_decl_column : 12
    <e60>   DW_AT_type        : <0x29e>
    <e64>   DW_AT_data_member_location: 16
 <2><e65>: Abbrev Number: 3 (DW_TAG_member)
    <e66>   DW_AT_name        : (indirect string, offset: 0xca2e9): MemDataAlignment
    <e6a>   DW_AT_decl_file   : 10
    <e6b>   DW_AT_decl_line   : 65
    <e6c>   DW_AT_decl_column : 12
    <e6d>   DW_AT_type        : <0x29e>
    <e71>   DW_AT_data_member_location: 20
 <2><e72>: Abbrev Number: 3 (DW_TAG_member)
    <e73>   DW_AT_name        : (indirect string, offset: 0xe2d2b): Mode
    <e77>   DW_AT_decl_file   : 10
    <e78>   DW_AT_decl_line   : 68
    <e79>   DW_AT_decl_column : 12
    <e7a>   DW_AT_type        : <0x29e>
    <e7e>   DW_AT_data_member_location: 24
 <2><e7f>: Abbrev Number: 3 (DW_TAG_member)
    <e80>   DW_AT_name        : (indirect string, offset: 0xe1c0b): Priority
    <e84>   DW_AT_decl_file   : 10
    <e85>   DW_AT_decl_line   : 73
    <e86>   DW_AT_decl_column : 12
    <e87>   DW_AT_type        : <0x29e>
    <e8b>   DW_AT_data_member_location: 28
 <2><e8c>: Abbrev Number: 0
 <1><e8d>: Abbrev Number: 4 (DW_TAG_typedef)
    <e8e>   DW_AT_name        : (indirect string, offset: 0x3c87c): DMA_InitTypeDef
    <e92>   DW_AT_decl_file   : 10
    <e93>   DW_AT_decl_line   : 75
    <e94>   DW_AT_decl_column : 3
    <e95>   DW_AT_type        : <0xe1c>
 <1><e99>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <e9a>   DW_AT_encoding    : 7	(unsigned)
    <e9b>   DW_AT_byte_size   : 1
    <e9c>   DW_AT_type        : <0x214>
    <ea0>   DW_AT_decl_file   : 10
    <ea1>   DW_AT_decl_line   : 81
    <ea2>   DW_AT_decl_column : 1
    <ea3>   DW_AT_sibling     : <0xec0>
 <2><ea7>: Abbrev Number: 2 (DW_TAG_enumerator)
    <ea8>   DW_AT_name        : (indirect string, offset: 0xa73b0): HAL_DMA_STATE_RESET
    <eac>   DW_AT_const_value : 0
 <2><ead>: Abbrev Number: 2 (DW_TAG_enumerator)
    <eae>   DW_AT_name        : (indirect string, offset: 0x3dc7d): HAL_DMA_STATE_READY
    <eb2>   DW_AT_const_value : 1
 <2><eb3>: Abbrev Number: 2 (DW_TAG_enumerator)
    <eb4>   DW_AT_name        : (indirect string, offset: 0x9b427): HAL_DMA_STATE_BUSY
    <eb8>   DW_AT_const_value : 2
 <2><eb9>: Abbrev Number: 2 (DW_TAG_enumerator)
    <eba>   DW_AT_name        : (indirect string, offset: 0xdc60f): HAL_DMA_STATE_TIMEOUT
    <ebe>   DW_AT_const_value : 3
 <2><ebf>: Abbrev Number: 0
 <1><ec0>: Abbrev Number: 4 (DW_TAG_typedef)
    <ec1>   DW_AT_name        : (indirect string, offset: 0xafc96): HAL_DMA_StateTypeDef
    <ec5>   DW_AT_decl_file   : 10
    <ec6>   DW_AT_decl_line   : 86
    <ec7>   DW_AT_decl_column : 3
    <ec8>   DW_AT_type        : <0xe99>
 <1><ecc>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <ecd>   DW_AT_type        : <0xec0>
 <1><ed1>: Abbrev Number: 32 (DW_TAG_structure_type)
    <ed2>   DW_AT_name        : (indirect string, offset: 0xbef25): __DMA_HandleTypeDef
    <ed6>   DW_AT_byte_size   : 96
    <ed7>   DW_AT_decl_file   : 10
    <ed8>   DW_AT_decl_line   : 114
    <ed9>   DW_AT_decl_column : 16
    <ed9>   DW_AT_sibling     : <0xfc8>
 <2><edd>: Abbrev Number: 3 (DW_TAG_member)
    <ede>   DW_AT_name        : (indirect string, offset: 0x571d9): Instance
    <ee2>   DW_AT_decl_file   : 10
    <ee3>   DW_AT_decl_line   : 116
    <ee4>   DW_AT_decl_column : 27
    <ee5>   DW_AT_type        : <0xfc8>
    <ee9>   DW_AT_data_member_location: 0
 <2><eea>: Abbrev Number: 3 (DW_TAG_member)
    <eeb>   DW_AT_name        : (indirect string, offset: 0xe4da5): Init
    <eef>   DW_AT_decl_file   : 10
    <ef0>   DW_AT_decl_line   : 118
    <ef1>   DW_AT_decl_column : 25
    <ef2>   DW_AT_type        : <0xe8d>
    <ef6>   DW_AT_data_member_location: 4
 <2><ef7>: Abbrev Number: 3 (DW_TAG_member)
    <ef8>   DW_AT_name        : (indirect string, offset: 0x9fb10): Lock
    <efc>   DW_AT_decl_file   : 10
    <efd>   DW_AT_decl_line   : 120
    <efe>   DW_AT_decl_column : 25
    <eff>   DW_AT_type        : <0xe10>
    <f03>   DW_AT_data_member_location: 36
 <2><f04>: Abbrev Number: 3 (DW_TAG_member)
    <f05>   DW_AT_name        : (indirect string, offset: 0xe5f22): State
    <f09>   DW_AT_decl_file   : 10
    <f0a>   DW_AT_decl_line   : 122
    <f0b>   DW_AT_decl_column : 30
    <f0c>   DW_AT_type        : <0xecc>
    <f10>   DW_AT_data_member_location: 37
 <2><f11>: Abbrev Number: 3 (DW_TAG_member)
    <f12>   DW_AT_name        : (indirect string, offset: 0xd53a6): Parent
    <f16>   DW_AT_decl_file   : 10
    <f17>   DW_AT_decl_line   : 124
    <f18>   DW_AT_decl_column : 26
    <f19>   DW_AT_type        : <0xfcd>
    <f1d>   DW_AT_data_member_location: 40
 <2><f1e>: Abbrev Number: 3 (DW_TAG_member)
    <f1f>   DW_AT_name        : (indirect string, offset: 0xdefd6): XferCpltCallback
    <f23>   DW_AT_decl_file   : 10
    <f24>   DW_AT_decl_line   : 126
    <f25>   DW_AT_decl_column : 11
    <f26>   DW_AT_type        : <0xfdf>
    <f2a>   DW_AT_data_member_location: 44
 <2><f2b>: Abbrev Number: 3 (DW_TAG_member)
    <f2c>   DW_AT_name        : (indirect string, offset: 0xae7a1): XferHalfCpltCallback
    <f30>   DW_AT_decl_file   : 10
    <f31>   DW_AT_decl_line   : 128
    <f32>   DW_AT_decl_column : 11
    <f33>   DW_AT_type        : <0xfdf>
    <f37>   DW_AT_data_member_location: 48
 <2><f38>: Abbrev Number: 3 (DW_TAG_member)
    <f39>   DW_AT_name        : (indirect string, offset: 0x1fb0c): XferErrorCallback
    <f3d>   DW_AT_decl_file   : 10
    <f3e>   DW_AT_decl_line   : 130
    <f3f>   DW_AT_decl_column : 11
    <f40>   DW_AT_type        : <0xfdf>
    <f44>   DW_AT_data_member_location: 52
 <2><f45>: Abbrev Number: 3 (DW_TAG_member)
    <f46>   DW_AT_name        : (indirect string, offset: 0xd11a6): XferAbortCallback
    <f4a>   DW_AT_decl_file   : 10
    <f4b>   DW_AT_decl_line   : 132
    <f4c>   DW_AT_decl_column : 11
    <f4d>   DW_AT_type        : <0xfdf>
    <f51>   DW_AT_data_member_location: 56
 <2><f52>: Abbrev Number: 3 (DW_TAG_member)
    <f53>   DW_AT_name        : (indirect string, offset: 0x99950): ErrorCode
    <f57>   DW_AT_decl_file   : 10
    <f58>   DW_AT_decl_line   : 134
    <f59>   DW_AT_decl_column : 26
    <f5a>   DW_AT_type        : <0x2aa>
    <f5e>   DW_AT_data_member_location: 60
 <2><f5f>: Abbrev Number: 3 (DW_TAG_member)
    <f60>   DW_AT_name        : (indirect string, offset: 0x5a8fd): DmaBaseAddress
    <f64>   DW_AT_decl_file   : 10
    <f65>   DW_AT_decl_line   : 136
    <f66>   DW_AT_decl_column : 27
    <f67>   DW_AT_type        : <0xfe4>
    <f6b>   DW_AT_data_member_location: 64
 <2><f6c>: Abbrev Number: 3 (DW_TAG_member)
    <f6d>   DW_AT_name        : (indirect string, offset: 0xcfba3): ChannelIndex
    <f71>   DW_AT_decl_file   : 10
    <f72>   DW_AT_decl_line   : 138
    <f73>   DW_AT_decl_column : 26
    <f74>   DW_AT_type        : <0x29e>
    <f78>   DW_AT_data_member_location: 68
 <2><f79>: Abbrev Number: 3 (DW_TAG_member)
    <f7a>   DW_AT_name        : (indirect string, offset: 0xd299): DMAmuxChannel
    <f7e>   DW_AT_decl_file   : 10
    <f7f>   DW_AT_decl_line   : 140
    <f80>   DW_AT_decl_column : 37
    <f81>   DW_AT_type        : <0xfe9>
    <f85>   DW_AT_data_member_location: 72
 <2><f86>: Abbrev Number: 3 (DW_TAG_member)
    <f87>   DW_AT_name        : (indirect string, offset: 0x522dc): DMAmuxChannelStatus
    <f8b>   DW_AT_decl_file   : 10
    <f8c>   DW_AT_decl_line   : 142
    <f8d>   DW_AT_decl_column : 37
    <f8e>   DW_AT_type        : <0xfee>
    <f92>   DW_AT_data_member_location: 76
 <2><f93>: Abbrev Number: 3 (DW_TAG_member)
    <f94>   DW_AT_name        : (indirect string, offset: 0xab3e0): DMAmuxChannelStatusMask
    <f98>   DW_AT_decl_file   : 10
    <f99>   DW_AT_decl_line   : 144
    <f9a>   DW_AT_decl_column : 36
    <f9b>   DW_AT_type        : <0x29e>
    <f9f>   DW_AT_data_member_location: 80
 <2><fa0>: Abbrev Number: 3 (DW_TAG_member)
    <fa1>   DW_AT_name        : (indirect string, offset: 0x4233b): DMAmuxRequestGen
    <fa5>   DW_AT_decl_file   : 10
    <fa6>   DW_AT_decl_line   : 146
    <fa7>   DW_AT_decl_column : 37
    <fa8>   DW_AT_type        : <0xff3>
    <fac>   DW_AT_data_member_location: 84
 <2><fad>: Abbrev Number: 3 (DW_TAG_member)
    <fae>   DW_AT_name        : (indirect string, offset: 0xb2212): DMAmuxRequestGenStatus
    <fb2>   DW_AT_decl_file   : 10
    <fb3>   DW_AT_decl_line   : 148
    <fb4>   DW_AT_decl_column : 37
    <fb5>   DW_AT_type        : <0xff8>
    <fb9>   DW_AT_data_member_location: 88
 <2><fba>: Abbrev Number: 3 (DW_TAG_member)
    <fbb>   DW_AT_name        : (indirect string, offset: 0xb5801): DMAmuxRequestGenStatusMask
    <fbf>   DW_AT_decl_file   : 10
    <fc0>   DW_AT_decl_line   : 150
    <fc1>   DW_AT_decl_column : 36
    <fc2>   DW_AT_type        : <0x29e>
    <fc6>   DW_AT_data_member_location: 92
 <2><fc7>: Abbrev Number: 0
 <1><fc8>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <fc9>   DW_AT_byte_size   : 4
    <fc9>   DW_AT_type        : <0x32f>
 <1><fcd>: Abbrev Number: 43 (DW_TAG_pointer_type)
    <fce>   DW_AT_byte_size   : 4
 <1><fcf>: Abbrev Number: 33 (DW_TAG_subroutine_type)
    <fd0>   DW_AT_prototyped  : 1
    <fd0>   DW_AT_sibling     : <0xfda>
 <2><fd4>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <fd5>   DW_AT_type        : <0xfda>
 <2><fd9>: Abbrev Number: 0
 <1><fda>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <fdb>   DW_AT_byte_size   : 4
    <fdb>   DW_AT_type        : <0xed1>
 <1><fdf>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <fe0>   DW_AT_byte_size   : 4
    <fe0>   DW_AT_type        : <0xfcf>
 <1><fe4>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <fe5>   DW_AT_byte_size   : 4
    <fe5>   DW_AT_type        : <0x361>
 <1><fe9>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <fea>   DW_AT_byte_size   : 4
    <fea>   DW_AT_type        : <0x385>
 <1><fee>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <fef>   DW_AT_byte_size   : 4
    <fef>   DW_AT_type        : <0x3b7>
 <1><ff3>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ff4>   DW_AT_byte_size   : 4
    <ff4>   DW_AT_type        : <0x3db>
 <1><ff8>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ff9>   DW_AT_byte_size   : 4
    <ff9>   DW_AT_type        : <0x40d>
 <1><ffd>: Abbrev Number: 4 (DW_TAG_typedef)
    <ffe>   DW_AT_name        : (indirect string, offset: 0xbef27): DMA_HandleTypeDef
    <1002>   DW_AT_decl_file   : 10
    <1003>   DW_AT_decl_line   : 151
    <1004>   DW_AT_decl_column : 3
    <1005>   DW_AT_type        : <0xed1>
 <1><1009>: Abbrev Number: 18 (DW_TAG_structure_type)
    <100a>   DW_AT_byte_size   : 20
    <100b>   DW_AT_decl_file   : 11
    <100c>   DW_AT_decl_line   : 47
    <100d>   DW_AT_decl_column : 9
    <100d>   DW_AT_sibling     : <0x1052>
 <2><1011>: Abbrev Number: 34 (DW_TAG_member)
    <1012>   DW_AT_name        : Pin
    <1016>   DW_AT_decl_file   : 11
    <1017>   DW_AT_decl_line   : 49
    <1018>   DW_AT_decl_column : 12
    <1019>   DW_AT_type        : <0x29e>
    <101d>   DW_AT_data_member_location: 0
 <2><101d>: Abbrev Number: 3 (DW_TAG_member)
    <101e>   DW_AT_name        : (indirect string, offset: 0xe2d2b): Mode
    <1022>   DW_AT_decl_file   : 11
    <1023>   DW_AT_decl_line   : 52
    <1024>   DW_AT_decl_column : 12
    <1025>   DW_AT_type        : <0x29e>
    <1029>   DW_AT_data_member_location: 4
 <2><102a>: Abbrev Number: 3 (DW_TAG_member)
    <102b>   DW_AT_name        : (indirect string, offset: 0x73a0b): Pull
    <102f>   DW_AT_decl_file   : 11
    <1030>   DW_AT_decl_line   : 55
    <1031>   DW_AT_decl_column : 12
    <1032>   DW_AT_type        : <0x29e>
    <1036>   DW_AT_data_member_location: 8
 <2><1037>: Abbrev Number: 3 (DW_TAG_member)
    <1038>   DW_AT_name        : (indirect string, offset: 0x839d0): Speed
    <103c>   DW_AT_decl_file   : 11
    <103d>   DW_AT_decl_line   : 58
    <103e>   DW_AT_decl_column : 12
    <103f>   DW_AT_type        : <0x29e>
    <1043>   DW_AT_data_member_location: 12
 <2><1044>: Abbrev Number: 3 (DW_TAG_member)
    <1045>   DW_AT_name        : (indirect string, offset: 0x66ae2): Alternate
    <1049>   DW_AT_decl_file   : 11
    <104a>   DW_AT_decl_line   : 61
    <104b>   DW_AT_decl_column : 12
    <104c>   DW_AT_type        : <0x29e>
    <1050>   DW_AT_data_member_location: 16
 <2><1051>: Abbrev Number: 0
 <1><1052>: Abbrev Number: 4 (DW_TAG_typedef)
    <1053>   DW_AT_name        : (indirect string, offset: 0xafba9): GPIO_InitTypeDef
    <1057>   DW_AT_decl_file   : 11
    <1058>   DW_AT_decl_line   : 63
    <1059>   DW_AT_decl_column : 3
    <105a>   DW_AT_type        : <0x1009>
 <1><105e>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <105f>   DW_AT_encoding    : 7	(unsigned)
    <1060>   DW_AT_byte_size   : 1
    <1061>   DW_AT_type        : <0x214>
    <1065>   DW_AT_decl_file   : 11
    <1066>   DW_AT_decl_line   : 69
    <1067>   DW_AT_decl_column : 1
    <1068>   DW_AT_sibling     : <0x1079>
 <2><106c>: Abbrev Number: 2 (DW_TAG_enumerator)
    <106d>   DW_AT_name        : (indirect string, offset: 0x2e2ec): GPIO_PIN_RESET
    <1071>   DW_AT_const_value : 0
 <2><1072>: Abbrev Number: 2 (DW_TAG_enumerator)
    <1073>   DW_AT_name        : (indirect string, offset: 0x38b64): GPIO_PIN_SET
    <1077>   DW_AT_const_value : 1
 <2><1078>: Abbrev Number: 0
 <1><1079>: Abbrev Number: 4 (DW_TAG_typedef)
    <107a>   DW_AT_name        : (indirect string, offset: 0xdbef4): GPIO_PinState
    <107e>   DW_AT_decl_file   : 11
    <107f>   DW_AT_decl_line   : 72
    <1080>   DW_AT_decl_column : 3
    <1081>   DW_AT_type        : <0x105e>
 <1><1085>: Abbrev Number: 18 (DW_TAG_structure_type)
    <1086>   DW_AT_byte_size   : 32
    <1087>   DW_AT_decl_file   : 12
    <1088>   DW_AT_decl_line   : 54
    <1089>   DW_AT_decl_column : 9
    <1089>   DW_AT_sibling     : <0x10f6>
 <2><108d>: Abbrev Number: 3 (DW_TAG_member)
    <108e>   DW_AT_name        : (indirect string, offset: 0x4f053): dev_endpoints
    <1092>   DW_AT_decl_file   : 12
    <1093>   DW_AT_decl_line   : 56
    <1094>   DW_AT_decl_column : 12
    <1095>   DW_AT_type        : <0x29e>
    <1099>   DW_AT_data_member_location: 0
 <2><109a>: Abbrev Number: 3 (DW_TAG_member)
    <109b>   DW_AT_name        : (indirect string, offset: 0xb0f67): speed
    <109f>   DW_AT_decl_file   : 12
    <10a0>   DW_AT_decl_line   : 60
    <10a1>   DW_AT_decl_column : 12
    <10a2>   DW_AT_type        : <0x29e>
    <10a6>   DW_AT_data_member_location: 4
 <2><10a7>: Abbrev Number: 3 (DW_TAG_member)
    <10a8>   DW_AT_name        : (indirect string, offset: 0xce61b): ep0_mps
    <10ac>   DW_AT_decl_file   : 12
    <10ad>   DW_AT_decl_line   : 64
    <10ae>   DW_AT_decl_column : 12
    <10af>   DW_AT_type        : <0x29e>
    <10b3>   DW_AT_data_member_location: 8
 <2><10b4>: Abbrev Number: 3 (DW_TAG_member)
    <10b5>   DW_AT_name        : (indirect string, offset: 0x870f8): phy_itface
    <10b9>   DW_AT_decl_file   : 12
    <10ba>   DW_AT_decl_line   : 66
    <10bb>   DW_AT_decl_column : 12
    <10bc>   DW_AT_type        : <0x29e>
    <10c0>   DW_AT_data_member_location: 12
 <2><10c1>: Abbrev Number: 3 (DW_TAG_member)
    <10c2>   DW_AT_name        : (indirect string, offset: 0x87bc7): Sof_enable
    <10c6>   DW_AT_decl_file   : 12
    <10c7>   DW_AT_decl_line   : 69
    <10c8>   DW_AT_decl_column : 12
    <10c9>   DW_AT_type        : <0x29e>
    <10cd>   DW_AT_data_member_location: 16
 <2><10ce>: Abbrev Number: 3 (DW_TAG_member)
    <10cf>   DW_AT_name        : (indirect string, offset: 0x5d6ff): low_power_enable
    <10d3>   DW_AT_decl_file   : 12
    <10d4>   DW_AT_decl_line   : 71
    <10d5>   DW_AT_decl_column : 12
    <10d6>   DW_AT_type        : <0x29e>
    <10da>   DW_AT_data_member_location: 20
 <2><10db>: Abbrev Number: 3 (DW_TAG_member)
    <10dc>   DW_AT_name        : (indirect string, offset: 0xa9b84): lpm_enable
    <10e0>   DW_AT_decl_file   : 12
    <10e1>   DW_AT_decl_line   : 73
    <10e2>   DW_AT_decl_column : 12
    <10e3>   DW_AT_type        : <0x29e>
    <10e7>   DW_AT_data_member_location: 24
 <2><10e8>: Abbrev Number: 3 (DW_TAG_member)
    <10e9>   DW_AT_name        : (indirect string, offset: 0x5425a): battery_charging_enable
    <10ed>   DW_AT_decl_file   : 12
    <10ee>   DW_AT_decl_line   : 75
    <10ef>   DW_AT_decl_column : 12
    <10f0>   DW_AT_type        : <0x29e>
    <10f4>   DW_AT_data_member_location: 28
 <2><10f5>: Abbrev Number: 0
 <1><10f6>: Abbrev Number: 4 (DW_TAG_typedef)
    <10f7>   DW_AT_name        : (indirect string, offset: 0x3c2ca): USB_CfgTypeDef
    <10fb>   DW_AT_decl_file   : 12
    <10fc>   DW_AT_decl_line   : 76
    <10fd>   DW_AT_decl_column : 3
    <10fe>   DW_AT_type        : <0x1085>
 <1><1102>: Abbrev Number: 18 (DW_TAG_structure_type)
    <1103>   DW_AT_byte_size   : 40
    <1104>   DW_AT_decl_file   : 12
    <1105>   DW_AT_decl_line   : 78
    <1106>   DW_AT_decl_column : 9
    <1106>   DW_AT_sibling     : <0x11cd>
 <2><110a>: Abbrev Number: 34 (DW_TAG_member)
    <110b>   DW_AT_name        : num
    <110f>   DW_AT_decl_file   : 12
    <1110>   DW_AT_decl_line   : 80
    <1111>   DW_AT_decl_column : 13
    <1112>   DW_AT_type        : <0x277>
    <1116>   DW_AT_data_member_location: 0
 <2><1116>: Abbrev Number: 3 (DW_TAG_member)
    <1117>   DW_AT_name        : (indirect string, offset: 0x51e34): is_in
    <111b>   DW_AT_decl_file   : 12
    <111c>   DW_AT_decl_line   : 83
    <111d>   DW_AT_decl_column : 13
    <111e>   DW_AT_type        : <0x277>
    <1122>   DW_AT_data_member_location: 1
 <2><1123>: Abbrev Number: 3 (DW_TAG_member)
    <1124>   DW_AT_name        : (indirect string, offset: 0x13675): is_stall
    <1128>   DW_AT_decl_file   : 12
    <1129>   DW_AT_decl_line   : 86
    <112a>   DW_AT_decl_column : 13
    <112b>   DW_AT_type        : <0x277>
    <112f>   DW_AT_data_member_location: 2
 <2><1130>: Abbrev Number: 3 (DW_TAG_member)
    <1131>   DW_AT_name        : (indirect string, offset: 0xe2420): type
    <1135>   DW_AT_decl_file   : 12
    <1136>   DW_AT_decl_line   : 89
    <1137>   DW_AT_decl_column : 13
    <1138>   DW_AT_type        : <0x277>
    <113c>   DW_AT_data_member_location: 3
 <2><113d>: Abbrev Number: 3 (DW_TAG_member)
    <113e>   DW_AT_name        : (indirect string, offset: 0xc9101): data_pid_start
    <1142>   DW_AT_decl_file   : 12
    <1143>   DW_AT_decl_line   : 92
    <1144>   DW_AT_decl_column : 13
    <1145>   DW_AT_type        : <0x277>
    <1149>   DW_AT_data_member_location: 4
 <2><114a>: Abbrev Number: 3 (DW_TAG_member)
    <114b>   DW_AT_name        : (indirect string, offset: 0xdf1d6): pmaadress
    <114f>   DW_AT_decl_file   : 12
    <1150>   DW_AT_decl_line   : 96
    <1151>   DW_AT_decl_column : 13
    <1152>   DW_AT_type        : <0x28d>
    <1156>   DW_AT_data_member_location: 6
 <2><1157>: Abbrev Number: 3 (DW_TAG_member)
    <1158>   DW_AT_name        : (indirect string, offset: 0xc3c0): pmaaddr0
    <115c>   DW_AT_decl_file   : 12
    <115d>   DW_AT_decl_line   : 99
    <115e>   DW_AT_decl_column : 13
    <115f>   DW_AT_type        : <0x28d>
    <1163>   DW_AT_data_member_location: 8
 <2><1164>: Abbrev Number: 3 (DW_TAG_member)
    <1165>   DW_AT_name        : (indirect string, offset: 0xc3c9): pmaaddr1
    <1169>   DW_AT_decl_file   : 12
    <116a>   DW_AT_decl_line   : 102
    <116b>   DW_AT_decl_column : 13
    <116c>   DW_AT_type        : <0x28d>
    <1170>   DW_AT_data_member_location: 10
 <2><1171>: Abbrev Number: 3 (DW_TAG_member)
    <1172>   DW_AT_name        : (indirect string, offset: 0xbdc64): doublebuffer
    <1176>   DW_AT_decl_file   : 12
    <1177>   DW_AT_decl_line   : 105
    <1178>   DW_AT_decl_column : 13
    <1179>   DW_AT_type        : <0x277>
    <117d>   DW_AT_data_member_location: 12
 <2><117e>: Abbrev Number: 3 (DW_TAG_member)
    <117f>   DW_AT_name        : (indirect string, offset: 0x1ed77): maxpacket
    <1183>   DW_AT_decl_file   : 12
    <1184>   DW_AT_decl_line   : 109
    <1185>   DW_AT_decl_column : 13
    <1186>   DW_AT_type        : <0x29e>
    <118a>   DW_AT_data_member_location: 16
 <2><118b>: Abbrev Number: 3 (DW_TAG_member)
    <118c>   DW_AT_name        : (indirect string, offset: 0x1035c): xfer_buff
    <1190>   DW_AT_decl_file   : 12
    <1191>   DW_AT_decl_line   : 112
    <1192>   DW_AT_decl_column : 14
    <1193>   DW_AT_type        : <0x11cd>
    <1197>   DW_AT_data_member_location: 20
 <2><1198>: Abbrev Number: 3 (DW_TAG_member)
    <1199>   DW_AT_name        : (indirect string, offset: 0x48e4d): xfer_len
    <119d>   DW_AT_decl_file   : 12
    <119e>   DW_AT_decl_line   : 114
    <119f>   DW_AT_decl_column : 13
    <11a0>   DW_AT_type        : <0x29e>
    <11a4>   DW_AT_data_member_location: 24
 <2><11a5>: Abbrev Number: 3 (DW_TAG_member)
    <11a6>   DW_AT_name        : (indirect string, offset: 0xa7ff5): xfer_count
    <11aa>   DW_AT_decl_file   : 12
    <11ab>   DW_AT_decl_line   : 116
    <11ac>   DW_AT_decl_column : 13
    <11ad>   DW_AT_type        : <0x29e>
    <11b1>   DW_AT_data_member_location: 28
 <2><11b2>: Abbrev Number: 3 (DW_TAG_member)
    <11b3>   DW_AT_name        : (indirect string, offset: 0x7146f): xfer_len_db
    <11b7>   DW_AT_decl_file   : 12
    <11b8>   DW_AT_decl_line   : 118
    <11b9>   DW_AT_decl_column : 13
    <11ba>   DW_AT_type        : <0x29e>
    <11be>   DW_AT_data_member_location: 32
 <2><11bf>: Abbrev Number: 3 (DW_TAG_member)
    <11c0>   DW_AT_name        : (indirect string, offset: 0xb05dd): xfer_fill_db
    <11c4>   DW_AT_decl_file   : 12
    <11c5>   DW_AT_decl_line   : 120
    <11c6>   DW_AT_decl_column : 13
    <11c7>   DW_AT_type        : <0x277>
    <11cb>   DW_AT_data_member_location: 36
 <2><11cc>: Abbrev Number: 0
 <1><11cd>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <11ce>   DW_AT_byte_size   : 4
    <11ce>   DW_AT_type        : <0x277>
 <1><11d2>: Abbrev Number: 4 (DW_TAG_typedef)
    <11d3>   DW_AT_name        : (indirect string, offset: 0x38501): USB_EPTypeDef
    <11d7>   DW_AT_decl_file   : 12
    <11d8>   DW_AT_decl_line   : 121
    <11d9>   DW_AT_decl_column : 3
    <11da>   DW_AT_type        : <0x1102>
 <1><11de>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <11df>   DW_AT_encoding    : 7	(unsigned)
    <11e0>   DW_AT_byte_size   : 1
    <11e1>   DW_AT_type        : <0x214>
    <11e5>   DW_AT_decl_file   : 13
    <11e6>   DW_AT_decl_line   : 49
    <11e7>   DW_AT_decl_column : 1
    <11e8>   DW_AT_sibling     : <0x120b>
 <2><11ec>: Abbrev Number: 2 (DW_TAG_enumerator)
    <11ed>   DW_AT_name        : (indirect string, offset: 0xa8701): HAL_PCD_STATE_RESET
    <11f1>   DW_AT_const_value : 0
 <2><11f2>: Abbrev Number: 2 (DW_TAG_enumerator)
    <11f3>   DW_AT_name        : (indirect string, offset: 0x33c16): HAL_PCD_STATE_READY
    <11f7>   DW_AT_const_value : 1
 <2><11f8>: Abbrev Number: 2 (DW_TAG_enumerator)
    <11f9>   DW_AT_name        : (indirect string, offset: 0xc12e4): HAL_PCD_STATE_ERROR
    <11fd>   DW_AT_const_value : 2
 <2><11fe>: Abbrev Number: 2 (DW_TAG_enumerator)
    <11ff>   DW_AT_name        : (indirect string, offset: 0x19181): HAL_PCD_STATE_BUSY
    <1203>   DW_AT_const_value : 3
 <2><1204>: Abbrev Number: 2 (DW_TAG_enumerator)
    <1205>   DW_AT_name        : (indirect string, offset: 0xade30): HAL_PCD_STATE_TIMEOUT
    <1209>   DW_AT_const_value : 4
 <2><120a>: Abbrev Number: 0
 <1><120b>: Abbrev Number: 4 (DW_TAG_typedef)
    <120c>   DW_AT_name        : (indirect string, offset: 0x1abee): PCD_StateTypeDef
    <1210>   DW_AT_decl_file   : 13
    <1211>   DW_AT_decl_line   : 55
    <1212>   DW_AT_decl_column : 3
    <1213>   DW_AT_type        : <0x11de>
 <1><1217>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <1218>   DW_AT_type        : <0x120b>
 <1><121c>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <121d>   DW_AT_encoding    : 7	(unsigned)
    <121e>   DW_AT_byte_size   : 1
    <121f>   DW_AT_type        : <0x214>
    <1223>   DW_AT_decl_file   : 13
    <1224>   DW_AT_decl_line   : 59
    <1225>   DW_AT_decl_column : 1
    <1226>   DW_AT_sibling     : <0x1243>
 <2><122a>: Abbrev Number: 2 (DW_TAG_enumerator)
    <122b>   DW_AT_name        : (indirect string, offset: 0x8da4): LPM_L0
    <122f>   DW_AT_const_value : 0
 <2><1230>: Abbrev Number: 2 (DW_TAG_enumerator)
    <1231>   DW_AT_name        : (indirect string, offset: 0x8dab): LPM_L1
    <1235>   DW_AT_const_value : 1
 <2><1236>: Abbrev Number: 2 (DW_TAG_enumerator)
    <1237>   DW_AT_name        : (indirect string, offset: 0x8db2): LPM_L2
    <123b>   DW_AT_const_value : 2
 <2><123c>: Abbrev Number: 2 (DW_TAG_enumerator)
    <123d>   DW_AT_name        : (indirect string, offset: 0x8db9): LPM_L3
    <1241>   DW_AT_const_value : 3
 <2><1242>: Abbrev Number: 0
 <1><1243>: Abbrev Number: 4 (DW_TAG_typedef)
    <1244>   DW_AT_name        : (indirect string, offset: 0x48272): PCD_LPM_StateTypeDef
    <1248>   DW_AT_decl_file   : 13
    <1249>   DW_AT_decl_line   : 64
    <124a>   DW_AT_decl_column : 3
    <124b>   DW_AT_type        : <0x121c>
 <1><124f>: Abbrev Number: 4 (DW_TAG_typedef)
    <1250>   DW_AT_name        : (indirect string, offset: 0x9d15c): PCD_TypeDef
    <1254>   DW_AT_decl_file   : 13
    <1255>   DW_AT_decl_line   : 87
    <1256>   DW_AT_decl_column : 28
    <1257>   DW_AT_type        : <0xd94>
 <1><125b>: Abbrev Number: 4 (DW_TAG_typedef)
    <125c>   DW_AT_name        : (indirect string, offset: 0x3dbdf): PCD_InitTypeDef
    <1260>   DW_AT_decl_file   : 13
    <1261>   DW_AT_decl_line   : 88
    <1262>   DW_AT_decl_column : 28
    <1263>   DW_AT_type        : <0x10f6>
 <1><1267>: Abbrev Number: 4 (DW_TAG_typedef)
    <1268>   DW_AT_name        : (indirect string, offset: 0x6198e): PCD_EPTypeDef
    <126c>   DW_AT_decl_file   : 13
    <126d>   DW_AT_decl_line   : 89
    <126e>   DW_AT_decl_column : 28
    <126f>   DW_AT_type        : <0x11d2>
 <1><1273>: Abbrev Number: 35 (DW_TAG_structure_type)
    <1274>   DW_AT_byte_size   : 756
    <1276>   DW_AT_decl_file   : 13
    <1277>   DW_AT_decl_line   : 98
    <1278>   DW_AT_decl_column : 9
    <1278>   DW_AT_sibling     : <0x133d>
 <2><127c>: Abbrev Number: 3 (DW_TAG_member)
    <127d>   DW_AT_name        : (indirect string, offset: 0x571d9): Instance
    <1281>   DW_AT_decl_file   : 13
    <1282>   DW_AT_decl_line   : 101
    <1283>   DW_AT_decl_column : 28
    <1284>   DW_AT_type        : <0x133d>
    <1288>   DW_AT_data_member_location: 0
 <2><1289>: Abbrev Number: 3 (DW_TAG_member)
    <128a>   DW_AT_name        : (indirect string, offset: 0xe4da5): Init
    <128e>   DW_AT_decl_file   : 13
    <128f>   DW_AT_decl_line   : 102
    <1290>   DW_AT_decl_column : 27
    <1291>   DW_AT_type        : <0x125b>
    <1295>   DW_AT_data_member_location: 4
 <2><1296>: Abbrev Number: 3 (DW_TAG_member)
    <1297>   DW_AT_name        : (indirect string, offset: 0x7fa1e): USB_Address
    <129b>   DW_AT_decl_file   : 13
    <129c>   DW_AT_decl_line   : 103
    <129d>   DW_AT_decl_column : 27
    <129e>   DW_AT_type        : <0x283>
    <12a2>   DW_AT_data_member_location: 36
 <2><12a3>: Abbrev Number: 3 (DW_TAG_member)
    <12a4>   DW_AT_name        : (indirect string, offset: 0x4511d): IN_ep
    <12a8>   DW_AT_decl_file   : 13
    <12a9>   DW_AT_decl_line   : 104
    <12aa>   DW_AT_decl_column : 27
    <12ab>   DW_AT_type        : <0x1342>
    <12af>   DW_AT_data_member_location: 40
 <2><12b0>: Abbrev Number: 17 (DW_TAG_member)
    <12b1>   DW_AT_name        : (indirect string, offset: 0x41f8e): OUT_ep
    <12b5>   DW_AT_decl_file   : 13
    <12b6>   DW_AT_decl_line   : 105
    <12b7>   DW_AT_decl_column : 27
    <12b8>   DW_AT_type        : <0x1342>
    <12bc>   DW_AT_data_member_location: 360
 <2><12be>: Abbrev Number: 17 (DW_TAG_member)
    <12bf>   DW_AT_name        : (indirect string, offset: 0x9fb10): Lock
    <12c3>   DW_AT_decl_file   : 13
    <12c4>   DW_AT_decl_line   : 106
    <12c5>   DW_AT_decl_column : 27
    <12c6>   DW_AT_type        : <0xe10>
    <12ca>   DW_AT_data_member_location: 680
 <2><12cc>: Abbrev Number: 17 (DW_TAG_member)
    <12cd>   DW_AT_name        : (indirect string, offset: 0xe5f22): State
    <12d1>   DW_AT_decl_file   : 13
    <12d2>   DW_AT_decl_line   : 107
    <12d3>   DW_AT_decl_column : 27
    <12d4>   DW_AT_type        : <0x1217>
    <12d8>   DW_AT_data_member_location: 681
 <2><12da>: Abbrev Number: 17 (DW_TAG_member)
    <12db>   DW_AT_name        : (indirect string, offset: 0x99950): ErrorCode
    <12df>   DW_AT_decl_file   : 13
    <12e0>   DW_AT_decl_line   : 108
    <12e1>   DW_AT_decl_column : 27
    <12e2>   DW_AT_type        : <0x2aa>
    <12e6>   DW_AT_data_member_location: 684
 <2><12e8>: Abbrev Number: 17 (DW_TAG_member)
    <12e9>   DW_AT_name        : (indirect string, offset: 0xeb24a): Setup
    <12ed>   DW_AT_decl_file   : 13
    <12ee>   DW_AT_decl_line   : 109
